python3/cookbook.org
#+TITLE:     代码仓库
#+AUTHOR:    Hao Ruan
#+EMAIL:     haoru@cisco.com
#+LANGUAGE:  en
#+LINK_HOME: http://www.github.com/ruanhao
#+OPTIONS:   h:6 html-postamble:nil html-preamble:t tex:t f:t ^:nil
#+STARTUP:   showall
#+TOC:       headlines 3
#+HTML_DOCTYPE: <!DOCTYPE html>
#+HTML_HEAD: <link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
#+HTML_HEAD: <link href="../org-html-themes/solarized/style.css" rel="stylesheet" type="text/css" />
 #+HTML: <div class="outline-2" id="meta">
| Author   | {{{author}}} ({{{email}}})    |
| Date     | {{{time(%Y-%m-%d %H:%M:%S)}}} |
#+HTML: </div>


* 类

** 不调用 =__init__= 方法来创建实例

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  from time import localtime

  class Date:
      def __init__(self, year, month, day):
          self.year = year
          self.month = month
          self.day = day

      # Class method that bypasses __init__
      @classmethod
      def today(cls):
          d = cls.__new__(cls)
          t = localtime()
          d.year = t.tm_year
          d.month = t.tm_mon
          d.day = t.tm_mday
          return d

  d = Date.__new__(Date)
  print(d)
  print(hasattr(d,'year'))

  data = {
      'year' : 2012,
      'month' : 8,
      'day' : 29
  }

  d.__dict__.update(data)
  print(d.year)
  print(d.month)

  d = Date.today()
  print(d.year, d.month, d.day)
#+END_SRC

#+RESULTS:
: <__main__.Date object at 0x1085e1588>
: False
: 2012
: 8
: 2018 6 13


