python3/cookbook.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-06-13 Wed 13:24 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>代码仓库</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Hao Ruan">
<link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
<link href="../org-html-themes/solarized/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">代码仓库</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orged0031d">1. 类</a>
<ul>
<li><a href="#org4d5382b">1.1. 不调用 <code>__init__</code> 方法来创建实例</a></li>
<li><a href="#orgf1d292b">1.2. 创建缓存对象</a></li>
<li><a href="#org0ef3b42">1.3. 抽象类</a></li>
<li><a href="#orgf2ef52b">1.4. 动态定义类</a></li>
<li><a href="#orgd76864f">1.5. 使用元类控制类的创建</a>
<ul>
<li><a href="#orgfc4d6ef">1.5.1. 实例缓存</a></li>
<li><a href="#org9f1d677">1.5.2. 单例</a></li>
<li><a href="#org9a5dfd3">1.5.3. 禁用直接实例化</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgadf4ca1">2. 进程与多线程</a>
<ul>
<li><a href="#orgc889c12">2.1. 创建子进程</a></li>
<li><a href="#orgad82975">2.2. 子进程的输入输出</a></li>
<li><a href="#orga313918">2.3. 进程间通信</a></li>
<li><a href="#orgae578f0">2.4. 创建线程</a></li>
<li><a href="#org119d5bf">2.5. 线程加锁</a></li>
<li><a href="#org4a865f9">2.6. thread local 变量</a></li>
<li><a href="#org39e675d">2.7. 线程池</a></li>
</ul>
</li>
<li><a href="#org85ef7e2">3. 数据结构</a>
<ul>
<li><a href="#org958cf15">3.1. 列表</a>
<ul>
<li><a href="#orge6a4ac3">3.1.1. 列表中删除数据的陷阱</a>
<ul>
<li><a href="#org34339c1">3.1.1.1. 原理</a></li>
<li><a href="#org1073f50">3.1.1.2. 解决方法</a></li>
</ul>
</li>
<li><a href="#orgf72c3c3">3.1.2. 列表中出现频率最高</a></li>
<li><a href="#org5ffbd1f">3.1.3. 列表中最大或最小的几项</a></li>
<li><a href="#org39a1da7">3.1.4. 对列表中的数据分组</a></li>
<li><a href="#orgbe8eca1">3.1.5. 消除序列中的重复数据，同时保持数据顺序</a></li>
<li><a href="#org2dbc102">3.1.6. 序列解包 (unpack)</a></li>
<li><a href="#org0de15bd">3.1.7. flatten 列表</a></li>
</ul>
</li>
<li><a href="#org4a218de">3.2. 字典</a>
<ul>
<li><a href="#org5b12f87">3.2.1. 对字典作集合运算</a></li>
<li><a href="#orgda8d31a">3.2.2. 组合多个字典当作一个字典使用</a></li>
<li><a href="#org9e8ea17">3.2.3. 字典栈</a></li>
</ul>
</li>
<li><a href="#org809b10f">3.3. 队列</a>
<ul>
<li><a href="#org009d4f8">3.3.1. 优先队列</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org7cf8b6c">4. IO</a>
<ul>
<li><a href="#org02f86c0">4.1. 文件</a>
<ul>
<li><a href="#org39b5fa3">4.1.1. 将文件描述符包装成文件对象</a></li>
<li><a href="#orga098a6d">4.1.2. 改变已打开文件的编码方式</a></li>
</ul>
</li>
<li><a href="#org87d8b82">4.2. 内存 IO</a>
<ul>
<li><a href="#org3473dc3">4.2.1. 内存字符串</a></li>
<li><a href="#orgc138684">4.2.2. 内存比特流</a></li>
</ul>
</li>
<li><a href="#org602171e">4.3. 读写 JSON</a></li>
</ul>
</li>
<li><a href="#org45510ee">5. 模块</a>
<ul>
<li><a href="#orgb2b88b7">5.1. 猴子补丁</a></li>
<li><a href="#org3526916">5.2. 将模块拆分出多个文件</a></li>
</ul>
</li>
<li><a href="#orgec0490b">6. 数字，日期，时间</a>
<ul>
<li><a href="#orga6aa54e">6.1. time 模块</a>
<ul>
<li><a href="#org70ae658">6.1.1. 获取 Unix Timestamp</a></li>
<li><a href="#orgaba317d">6.1.2. 获取具体时间值</a></li>
</ul>
</li>
<li><a href="#org64a2472">6.2. datetime 模块</a>
<ul>
<li><a href="#orgff1c716">6.2.1. 创建时间</a></li>
<li><a href="#org93ede71">6.2.2. 获取 UTC 时间</a></li>
<li><a href="#org3a96270">6.2.3. 获取当前时区时间</a></li>
<li><a href="#org73db004">6.2.4. 日期运算</a></li>
<li><a href="#org8d839c3">6.2.5. 日期转字符串</a></li>
<li><a href="#orgeb80278">6.2.6. 字符串转日期</a></li>
</ul>
</li>
<li><a href="#org8e63728">6.3. 月份缩写</a></li>
<li><a href="#org22640c6">6.4. 数字精度格式化</a></li>
</ul>
</li>
<li><a href="#org1de1780">7. 字符串与文本</a>
<ul>
<li><a href="#org4e2a36b">7.1. 格式化</a>
<ul>
<li><a href="#orgeb87feb">7.1.1. 填充与对齐</a></li>
<li><a href="#orgd8a1681">7.1.2. 字符串截断</a></li>
<li><a href="#org778ad33">7.1.3. 占位符</a></li>
<li><a href="#orgeb49139">7.1.4. 排版</a></li>
</ul>
</li>
<li><a href="#org2861a98">7.2. 字符串匹配</a>
<ul>
<li><a href="#org3080b82">7.2.1. 使用 shell 风格的通配符匹配字符串</a></li>
<li><a href="#org6724b0d">7.2.2. 贪婪和非贪婪匹配</a></li>
</ul>
</li>
<li><a href="#org8becbcb">7.3. 密码输入</a></li>
</ul>
</li>
<li><a href="#orgd5d3c81">8. 参考资料</a></li>
</ul>
</div>
</div>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orged0031d">1. 类</a>
<ul>
<li><a href="#org4d5382b">1.1. 不调用 <code>__init__</code> 方法来创建实例</a></li>
<li><a href="#orgf1d292b">1.2. 创建缓存对象</a></li>
<li><a href="#org0ef3b42">1.3. 抽象类</a></li>
<li><a href="#orgf2ef52b">1.4. 动态定义类</a></li>
<li><a href="#orgd76864f">1.5. 使用元类控制类的创建</a>
<ul>
<li><a href="#orgfc4d6ef">1.5.1. 实例缓存</a></li>
<li><a href="#org9f1d677">1.5.2. 单例</a></li>
<li><a href="#org9a5dfd3">1.5.3. 禁用直接实例化</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgadf4ca1">2. 进程与多线程</a>
<ul>
<li><a href="#orgc889c12">2.1. 创建子进程</a></li>
<li><a href="#orgad82975">2.2. 子进程的输入输出</a></li>
<li><a href="#orga313918">2.3. 进程间通信</a></li>
<li><a href="#orgae578f0">2.4. 创建线程</a></li>
<li><a href="#org119d5bf">2.5. 线程加锁</a></li>
<li><a href="#org4a865f9">2.6. thread local 变量</a></li>
<li><a href="#org39e675d">2.7. 线程池</a></li>
</ul>
</li>
<li><a href="#org85ef7e2">3. 数据结构</a>
<ul>
<li><a href="#org958cf15">3.1. 列表</a>
<ul>
<li><a href="#orge6a4ac3">3.1.1. 列表中删除数据的陷阱</a></li>
<li><a href="#orgf72c3c3">3.1.2. 列表中出现频率最高</a></li>
<li><a href="#org5ffbd1f">3.1.3. 列表中最大或最小的几项</a></li>
<li><a href="#org39a1da7">3.1.4. 对列表中的数据分组</a></li>
<li><a href="#orgbe8eca1">3.1.5. 消除序列中的重复数据，同时保持数据顺序</a></li>
<li><a href="#org2dbc102">3.1.6. 序列解包 (unpack)</a></li>
<li><a href="#org0de15bd">3.1.7. flatten 列表</a></li>
</ul>
</li>
<li><a href="#org4a218de">3.2. 字典</a>
<ul>
<li><a href="#org5b12f87">3.2.1. 对字典作集合运算</a></li>
<li><a href="#orgda8d31a">3.2.2. 组合多个字典当作一个字典使用</a></li>
<li><a href="#org9e8ea17">3.2.3. 字典栈</a></li>
</ul>
</li>
<li><a href="#org809b10f">3.3. 队列</a>
<ul>
<li><a href="#org009d4f8">3.3.1. 优先队列</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org7cf8b6c">4. IO</a>
<ul>
<li><a href="#org02f86c0">4.1. 文件</a>
<ul>
<li><a href="#org39b5fa3">4.1.1. 将文件描述符包装成文件对象</a></li>
<li><a href="#orga098a6d">4.1.2. 改变已打开文件的编码方式</a></li>
</ul>
</li>
<li><a href="#org87d8b82">4.2. 内存 IO</a>
<ul>
<li><a href="#org3473dc3">4.2.1. 内存字符串</a></li>
<li><a href="#orgc138684">4.2.2. 内存比特流</a></li>
</ul>
</li>
<li><a href="#org602171e">4.3. 读写 JSON</a></li>
</ul>
</li>
<li><a href="#org45510ee">5. 模块</a>
<ul>
<li><a href="#orgb2b88b7">5.1. 猴子补丁</a></li>
<li><a href="#org3526916">5.2. 将模块拆分出多个文件</a></li>
</ul>
</li>
<li><a href="#orgec0490b">6. 数字，日期，时间</a>
<ul>
<li><a href="#orga6aa54e">6.1. time 模块</a>
<ul>
<li><a href="#org70ae658">6.1.1. 获取 Unix Timestamp</a></li>
<li><a href="#orgaba317d">6.1.2. 获取具体时间值</a></li>
</ul>
</li>
<li><a href="#org64a2472">6.2. datetime 模块</a>
<ul>
<li><a href="#orgff1c716">6.2.1. 创建时间</a></li>
<li><a href="#org93ede71">6.2.2. 获取 UTC 时间</a></li>
<li><a href="#org3a96270">6.2.3. 获取当前时区时间</a></li>
<li><a href="#org73db004">6.2.4. 日期运算</a></li>
<li><a href="#org8d839c3">6.2.5. 日期转字符串</a></li>
<li><a href="#orgeb80278">6.2.6. 字符串转日期</a></li>
</ul>
</li>
<li><a href="#org8e63728">6.3. 月份缩写</a></li>
<li><a href="#org22640c6">6.4. 数字精度格式化</a></li>
</ul>
</li>
<li><a href="#org1de1780">7. 字符串与文本</a>
<ul>
<li><a href="#org4e2a36b">7.1. 格式化</a>
<ul>
<li><a href="#orgeb87feb">7.1.1. 填充与对齐</a></li>
<li><a href="#orgd8a1681">7.1.2. 字符串截断</a></li>
<li><a href="#org778ad33">7.1.3. 占位符</a></li>
<li><a href="#orgeb49139">7.1.4. 排版</a></li>
</ul>
</li>
<li><a href="#org2861a98">7.2. 字符串匹配</a>
<ul>
<li><a href="#org3080b82">7.2.1. 使用 shell 风格的通配符匹配字符串</a></li>
<li><a href="#org6724b0d">7.2.2. 贪婪和非贪婪匹配</a></li>
</ul>
</li>
<li><a href="#org8becbcb">7.3. 密码输入</a></li>
</ul>
</li>
<li><a href="#orgd5d3c81">8. 参考资料</a></li>
</ul>
</div>
</div>
<div class="outline-2" id="meta">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">Author</td>
<td class="org-left">Hao Ruan (haoru@cisco.com)</td>
</tr>

<tr>
<td class="org-left">Date</td>
<td class="org-left">2018-06-13 13:24:16</td>
</tr>
</tbody>
</table>
</div>


<div id="outline-container-orged0031d" class="outline-2">
<h2 id="orged0031d"><span class="section-number-2">1</span> 类</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org4d5382b" class="outline-3">
<h3 id="org4d5382b"><span class="section-number-3">1.1</span> 不调用 <code>__init__</code> 方法来创建实例</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #ff358b; font-weight: bold;">from</span> time <span style="color: #ff358b; font-weight: bold;">import</span> localtime

<span style="color: #ff358b; font-weight: bold;">class</span> <span style="color: #01b0f0; font-weight: bold;">Date</span>:
    <span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">__init__</span>(<span style="color: #ff358b; font-weight: bold;">self</span>, year, month, day):
        <span style="color: #ff358b; font-weight: bold;">self</span>.year = year
        <span style="color: #ff358b; font-weight: bold;">self</span>.month = month
        <span style="color: #ff358b; font-weight: bold;">self</span>.day = day

    <span style="color: #465457;"># </span><span style="color: #465457;">Class method that bypasses __init__</span>
    <span style="color: #01b0f0; font-weight: bold;">@classmethod</span>
    <span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">today</span>(cls):
        <span style="color: #dddd66;">d</span> = cls.__new__(cls)
        <span style="color: #dddd66;">t</span> = localtime()
        <span style="color: #dddd66;">d.year</span> = t.tm_year
        <span style="color: #dddd66;">d.month</span> = t.tm_mon
        <span style="color: #dddd66;">d.day</span> = t.tm_mday
        <span style="color: #ff358b; font-weight: bold;">return</span> d

<span style="color: #dddd66;">d</span> = Date.__new__(Date)
<span style="color: #ff358b; font-weight: bold;">print</span>(d)
<span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #f8fff9;">hasattr</span>(d,<span style="color: #ffa042;">'year'</span>))

<span style="color: #dddd66;">data</span> = {
    <span style="color: #ffa042;">'year'</span> : 2012,
    <span style="color: #ffa042;">'month'</span> : 8,
    <span style="color: #ffa042;">'day'</span> : 29
}

d.__dict__.update(data)
<span style="color: #ff358b; font-weight: bold;">print</span>(d.year)
<span style="color: #ff358b; font-weight: bold;">print</span>(d.month)

<span style="color: #dddd66;">d</span> = Date.today()
<span style="color: #ff358b; font-weight: bold;">print</span>(d.year, d.month, d.day)
</pre>
</div>

<pre class="example">
&lt;__main__.Date object at 0x1085e1588&gt;
False
2012
8
2018 6 13

</pre>
</div>
</div>
