python3/cookbook.org
** 创建缓存对象

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  class Spam:
      def __init__(self, name):
          self.name = name

  # Caching support
  import weakref
  _spam_cache = weakref.WeakValueDictionary()

  def get_spam(name):
      if name not in _spam_cache:
          s = Spam(name)
          _spam_cache[name] = s
      else:
          s = _spam_cache[name]
      return s

  if __name__ == '__main__':
      a = get_spam('foo')
      b = get_spam('bar')
      print('a is b:', a is b)
      c = get_spam('foo')
      print('a is c:', a is c)
#+END_SRC

#+RESULTS:
: a is b: False
: a is c: True


#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  import weakref

  class CachedSpamManager:
      def __init__(self):
          self._cache = weakref.WeakValueDictionary()
      def get_spam(self, name):
          if name not in self._cache:
              s = Spam(name)
              self._cache[name] = s
          else:
              s = self._cache[name]
          return s

  class Spam:
      def __init__(self, name):
          self.name = name

  Spam.manager = CachedSpamManager()

  def get_spam(name):
      return Spam.manager.get_spam(name)

  if __name__ == '__main__':
      a = get_spam('foo')
      b = get_spam('bar')
      print('a is b:', a is b)
      c = get_spam('foo')
      print('a is c:', a is c)
#+END_SRC

#+RESULTS:
: a is b: False
: a is c: True

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  # Example involving new and some of its problems

  import weakref

  class Spam:
      _spam_cache = weakref.WeakValueDictionary()
      def __new__(cls, name):
          if name in cls._spam_cache:
              return cls._spam_cache[name]
          else:
              self = super().__new__(cls)
              cls._spam_cache[name] = self
              return self

      def __init__(self, name):
          print('Initializing Spam')
          self.name = name

  if __name__ == '__main__':
      print("This should print 'Initializing Spam' twice")
      s = Spam('Dave')
      t = Spam('Dave')
      print(s is t)
#+END_SRC

#+RESULTS:
: This should print 'Initializing Spam' twice
: Initializing Spam
: Initializing Spam
: True

** 抽象类

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  from abc import ABCMeta, abstractmethod

  class A(metaclass=ABCMeta):
      @property
      @abstractmethod
      def name(self):
          pass

      @name.setter
      @abstractmethod
      def name(self, value):
          pass

      @classmethod
      @abstractmethod
      def method1(cls):
          pass

      @staticmethod
      @abstractmethod
      def method2():
          pass
#+END_SRC

#+RESULTS:


