python3/cookbook.html


<div id="outline-container-orgf1d292b" class="outline-3">
<h3 id="orgf1d292b"><span class="section-number-3">1.2</span> 创建缓存对象</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #ff358b; font-weight: bold;">class</span> <span style="color: #01b0f0; font-weight: bold;">Spam</span>:
    <span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">__init__</span>(<span style="color: #ff358b; font-weight: bold;">self</span>, name):
        <span style="color: #ff358b; font-weight: bold;">self</span>.name = name

<span style="color: #465457;"># </span><span style="color: #465457;">Caching support</span>
<span style="color: #ff358b; font-weight: bold;">import</span> weakref
<span style="color: #dddd66;">_spam_cache</span> = weakref.WeakValueDictionary()

<span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">get_spam</span>(name):
    <span style="color: #ff358b; font-weight: bold;">if</span> name <span style="color: #ff358b; font-weight: bold;">not</span> <span style="color: #ff358b; font-weight: bold;">in</span> _spam_cache:
        <span style="color: #dddd66;">s</span> = Spam(name)
        <span style="color: #dddd66;">_spam_cache</span>[name] = s
    <span style="color: #ff358b; font-weight: bold;">else</span>:
        <span style="color: #dddd66;">s</span> = _spam_cache[name]
    <span style="color: #ff358b; font-weight: bold;">return</span> s

<span style="color: #ff358b; font-weight: bold;">if</span> <span style="color: #f8fff9;">__name__</span> == <span style="color: #ffa042;">'__main__'</span>:
    <span style="color: #dddd66;">a</span> = get_spam(<span style="color: #ffa042;">'foo'</span>)
    <span style="color: #dddd66;">b</span> = get_spam(<span style="color: #ffa042;">'bar'</span>)
    <span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'a is b:'</span>, a <span style="color: #ff358b; font-weight: bold;">is</span> b)
    <span style="color: #dddd66;">c</span> = get_spam(<span style="color: #ffa042;">'foo'</span>)
    <span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'a is c:'</span>, a <span style="color: #ff358b; font-weight: bold;">is</span> c)
</pre>
</div>

<pre class="example">
a is b: False
a is c: True

</pre>


<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #ff358b; font-weight: bold;">import</span> weakref

<span style="color: #ff358b; font-weight: bold;">class</span> <span style="color: #01b0f0; font-weight: bold;">CachedSpamManager</span>:
    <span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">__init__</span>(<span style="color: #ff358b; font-weight: bold;">self</span>):
        <span style="color: #ff358b; font-weight: bold;">self</span>._cache = weakref.WeakValueDictionary()
    <span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">get_spam</span>(<span style="color: #ff358b; font-weight: bold;">self</span>, name):
        <span style="color: #ff358b; font-weight: bold;">if</span> name <span style="color: #ff358b; font-weight: bold;">not</span> <span style="color: #ff358b; font-weight: bold;">in</span> <span style="color: #ff358b; font-weight: bold;">self</span>._cache:
            <span style="color: #dddd66;">s</span> = Spam(name)
            <span style="color: #ff358b; font-weight: bold;">self</span>._cache[name] = s
        <span style="color: #ff358b; font-weight: bold;">else</span>:
            <span style="color: #dddd66;">s</span> = <span style="color: #ff358b; font-weight: bold;">self</span>._cache[name]
        <span style="color: #ff358b; font-weight: bold;">return</span> s

<span style="color: #ff358b; font-weight: bold;">class</span> <span style="color: #01b0f0; font-weight: bold;">Spam</span>:
    <span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">__init__</span>(<span style="color: #ff358b; font-weight: bold;">self</span>, name):
        <span style="color: #ff358b; font-weight: bold;">self</span>.name = name

<span style="color: #dddd66;">Spam.manager</span> = CachedSpamManager()

<span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">get_spam</span>(name):
    <span style="color: #ff358b; font-weight: bold;">return</span> Spam.manager.get_spam(name)

<span style="color: #ff358b; font-weight: bold;">if</span> <span style="color: #f8fff9;">__name__</span> == <span style="color: #ffa042;">'__main__'</span>:
    <span style="color: #dddd66;">a</span> = get_spam(<span style="color: #ffa042;">'foo'</span>)
    <span style="color: #dddd66;">b</span> = get_spam(<span style="color: #ffa042;">'bar'</span>)
    <span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'a is b:'</span>, a <span style="color: #ff358b; font-weight: bold;">is</span> b)
    <span style="color: #dddd66;">c</span> = get_spam(<span style="color: #ffa042;">'foo'</span>)
    <span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'a is c:'</span>, a <span style="color: #ff358b; font-weight: bold;">is</span> c)
</pre>
</div>

<pre class="example">
a is b: False
a is c: True

</pre>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #465457;"># </span><span style="color: #465457;">Example involving new and some of its problems</span>

<span style="color: #ff358b; font-weight: bold;">import</span> weakref

<span style="color: #ff358b; font-weight: bold;">class</span> <span style="color: #01b0f0; font-weight: bold;">Spam</span>:
    <span style="color: #dddd66;">_spam_cache</span> = weakref.WeakValueDictionary()
    <span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">__new__</span>(cls, name):
        <span style="color: #ff358b; font-weight: bold;">if</span> name <span style="color: #ff358b; font-weight: bold;">in</span> cls._spam_cache:
            <span style="color: #ff358b; font-weight: bold;">return</span> cls._spam_cache[name]
        <span style="color: #ff358b; font-weight: bold;">else</span>:
            <span style="color: #ff358b; font-weight: bold;">self</span> = <span style="color: #f8fff9;">super</span>().__new__(cls)
            <span style="color: #dddd66;">cls._spam_cache</span>[name] = <span style="color: #ff358b; font-weight: bold;">self</span>
            <span style="color: #ff358b; font-weight: bold;">return</span> <span style="color: #ff358b; font-weight: bold;">self</span>

    <span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">__init__</span>(<span style="color: #ff358b; font-weight: bold;">self</span>, name):
        <span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'Initializing Spam'</span>)
        <span style="color: #ff358b; font-weight: bold;">self</span>.name = name

<span style="color: #ff358b; font-weight: bold;">if</span> <span style="color: #f8fff9;">__name__</span> == <span style="color: #ffa042;">'__main__'</span>:
    <span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">"This should print 'Initializing Spam' twice"</span>)
    <span style="color: #dddd66;">s</span> = Spam(<span style="color: #ffa042;">'Dave'</span>)
    <span style="color: #dddd66;">t</span> = Spam(<span style="color: #ffa042;">'Dave'</span>)
    <span style="color: #ff358b; font-weight: bold;">print</span>(s <span style="color: #ff358b; font-weight: bold;">is</span> t)
</pre>
</div>

<pre class="example">
This should print 'Initializing Spam' twice
Initializing Spam
Initializing Spam
True

</pre>
</div>
</div>

<div id="outline-container-org0ef3b42" class="outline-3">
<h3 id="org0ef3b42"><span class="section-number-3">1.3</span> 抽象类</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #ff358b; font-weight: bold;">from</span> abc <span style="color: #ff358b; font-weight: bold;">import</span> ABCMeta, abstractmethod

<span style="color: #ff358b; font-weight: bold;">class</span> <span style="color: #01b0f0; font-weight: bold;">A</span>(metaclass=ABCMeta):
    <span style="color: #01b0f0; font-weight: bold;">@property</span>
    <span style="color: #01b0f0; font-weight: bold;">@abstractmethod</span>
    <span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">name</span>(<span style="color: #ff358b; font-weight: bold;">self</span>):
        <span style="color: #ff358b; font-weight: bold;">pass</span>

    <span style="color: #01b0f0; font-weight: bold;">@name.setter</span>
    <span style="color: #01b0f0; font-weight: bold;">@abstractmethod</span>
    <span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">name</span>(<span style="color: #ff358b; font-weight: bold;">self</span>, value):
        <span style="color: #ff358b; font-weight: bold;">pass</span>

    <span style="color: #01b0f0; font-weight: bold;">@classmethod</span>
    <span style="color: #01b0f0; font-weight: bold;">@abstractmethod</span>
    <span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">method1</span>(cls):
        <span style="color: #ff358b; font-weight: bold;">pass</span>

    <span style="color: #01b0f0; font-weight: bold;">@staticmethod</span>
    <span style="color: #01b0f0; font-weight: bold;">@abstractmethod</span>
    <span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">method2</span>():
        <span style="color: #ff358b; font-weight: bold;">pass</span>
</pre>
</div>
</div>
</div>
