python3/cookbook.org
** 动态定义类

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  # Example of making a class manually from parts

  # Methods
  def __init__(self, name, shares, price):
      self.name = name
      self.shares = shares
      self.price = price

  def cost(self):
      return self.shares * self.price

  cls_dict = {
      '__init__' : __init__,
      'cost' : cost,
  }

  # Make a class
  import types

  Stock = types.new_class('Stock', (), {}, lambda ns: ns.update(cls_dict))

  if __name__ == '__main__':
      s = Stock('ACME', 50, 91.1)
      print(s)
      print(s.cost())
#+END_SRC

#+RESULTS:
: <types.Stock object at 0x1085e1518>
: 4555.0


#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  # An alternative formulation of namedtuples

  import operator
  import types
  import sys

  def named_tuple(classname, fieldnames):
      # Populate a dictionary of field property accessors
      cls_dict = { name: property(operator.itemgetter(n))
                   for n, name in enumerate(fieldnames) }

      # Make a __new__ function and add to the class dict
      def __new__(cls, *args):
          if len(args) != len(fieldnames):
              raise TypeError('Expected {} arguments'.format(len(fieldnames)))
          return tuple.__new__(cls, (args))

      cls_dict['__new__'] = __new__

      # Make the class
      cls = types.new_class(classname, (tuple,), {},
                             lambda ns: ns.update(cls_dict))
      cls.__module__ = sys._getframe(1).f_globals['__name__']
      return cls

  if __name__ == '__main__':
      Point = named_tuple('Point', ['x', 'y'])
      print(Point)
      p = Point(4, 5)
      print(len(p))
      print(p.x, p[0])
      print(p.y, p[1])
      try:
          p.x = 2
      except AttributeError as e:
          print(e)
      print('%s %s' % p)
#+END_SRC

#+RESULTS:
: <class '__main__.Point'>
: 2
: 4 4
: 5 5
: can't set attribute
: 4 5


** 使用元类控制类的创建

*** 实例缓存

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  # Cached instances

  import weakref

  class Cached(type):
      def __init__(self, *args, **kwargs):
          super().__init__(*args, **kwargs)
          self.__cache = weakref.WeakValueDictionary()

      def __call__(self, *args):
          if args in self.__cache:
              return self.__cache[args]
          else:
              obj = super().__call__(*args)
              self.__cache[args] = obj
              return obj

  class Spam(metaclass=Cached):
      def __init__(self, name):
          print('Creating Spam({!r})'.format(name))
          self.name = name

  if __name__ == '__main__':
      a = Spam('foo')
      b = Spam('bar')
      print('a is b:', a is b)
      c = Spam('foo')
      print('a is c:', a is c)
#+END_SRC

#+RESULTS:
: Creating Spam('foo')
: Creating Spam('bar')
: a is b: False
: a is c: True


