python3/cookbook.html


<div id="outline-container-orgf2ef52b" class="outline-3">
<h3 id="orgf2ef52b"><span class="section-number-3">1.4</span> 动态定义类</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #465457;"># </span><span style="color: #465457;">Example of making a class manually from parts</span>

<span style="color: #465457;"># </span><span style="color: #465457;">Methods</span>
<span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">__init__</span>(<span style="color: #ff358b; font-weight: bold;">self</span>, name, shares, price):
    <span style="color: #ff358b; font-weight: bold;">self</span>.name = name
    <span style="color: #ff358b; font-weight: bold;">self</span>.shares = shares
    <span style="color: #ff358b; font-weight: bold;">self</span>.price = price

<span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">cost</span>(<span style="color: #ff358b; font-weight: bold;">self</span>):
    <span style="color: #ff358b; font-weight: bold;">return</span> <span style="color: #ff358b; font-weight: bold;">self</span>.shares * <span style="color: #ff358b; font-weight: bold;">self</span>.price

<span style="color: #dddd66;">cls_dict</span> = {
    <span style="color: #ffa042;">'__init__'</span> : __init__,
    <span style="color: #ffa042;">'cost'</span> : cost,
}

<span style="color: #465457;"># </span><span style="color: #465457;">Make a class</span>
<span style="color: #ff358b; font-weight: bold;">import</span> types

<span style="color: #dddd66;">Stock</span> = types.new_class(<span style="color: #ffa042;">'Stock'</span>, (), {}, <span style="color: #ff358b; font-weight: bold;">lambda</span> ns: ns.update(cls_dict))

<span style="color: #ff358b; font-weight: bold;">if</span> <span style="color: #f8fff9;">__name__</span> == <span style="color: #ffa042;">'__main__'</span>:
    <span style="color: #dddd66;">s</span> = Stock(<span style="color: #ffa042;">'ACME'</span>, 50, 91.1)
    <span style="color: #ff358b; font-weight: bold;">print</span>(s)
    <span style="color: #ff358b; font-weight: bold;">print</span>(s.cost())
</pre>
</div>

<pre class="example">
&lt;types.Stock object at 0x1085e1518&gt;
4555.0

</pre>


<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #465457;"># </span><span style="color: #465457;">An alternative formulation of namedtuples</span>

<span style="color: #ff358b; font-weight: bold;">import</span> operator
<span style="color: #ff358b; font-weight: bold;">import</span> types
<span style="color: #ff358b; font-weight: bold;">import</span> sys

<span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">named_tuple</span>(classname, fieldnames):
    <span style="color: #465457;"># </span><span style="color: #465457;">Populate a dictionary of field property accessors</span>
    <span style="color: #dddd66;">cls_dict</span> = { name: <span style="color: #f8fff9;">property</span>(operator.itemgetter(n))
                 <span style="color: #ff358b; font-weight: bold;">for</span> n, name <span style="color: #ff358b; font-weight: bold;">in</span> <span style="color: #f8fff9;">enumerate</span>(fieldnames) }

    <span style="color: #465457;"># </span><span style="color: #465457;">Make a __new__ function and add to the class dict</span>
    <span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">__new__</span>(cls, *args):
        <span style="color: #ff358b; font-weight: bold;">if</span> <span style="color: #f8fff9;">len</span>(args) != <span style="color: #f8fff9;">len</span>(fieldnames):
            <span style="color: #ff358b; font-weight: bold;">raise</span> <span style="color: #01b0f0; font-weight: bold;">TypeError</span>(<span style="color: #ffa042;">'Expected {} arguments'</span>.<span style="color: #f8fff9;">format</span>(<span style="color: #f8fff9;">len</span>(fieldnames)))
        <span style="color: #ff358b; font-weight: bold;">return</span> <span style="color: #f8fff9;">tuple</span>.__new__(cls, (args))

    <span style="color: #dddd66;">cls_dict</span>[<span style="color: #ffa042;">'__new__'</span>] = __new__

    <span style="color: #465457;"># </span><span style="color: #465457;">Make the class</span>
    <span style="color: #dddd66;">cls</span> = types.new_class(classname, (<span style="color: #f8fff9;">tuple</span>,), {},
                           <span style="color: #ff358b; font-weight: bold;">lambda</span> ns: ns.update(cls_dict))
    <span style="color: #dddd66;">cls.__module__</span> = sys._getframe(1).f_globals[<span style="color: #ffa042;">'__name__'</span>]
    <span style="color: #ff358b; font-weight: bold;">return</span> cls

<span style="color: #ff358b; font-weight: bold;">if</span> <span style="color: #f8fff9;">__name__</span> == <span style="color: #ffa042;">'__main__'</span>:
    <span style="color: #dddd66;">Point</span> = named_tuple(<span style="color: #ffa042;">'Point'</span>, [<span style="color: #ffa042;">'x'</span>, <span style="color: #ffa042;">'y'</span>])
    <span style="color: #ff358b; font-weight: bold;">print</span>(Point)
    <span style="color: #dddd66;">p</span> = Point(4, 5)
    <span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #f8fff9;">len</span>(p))
    <span style="color: #ff358b; font-weight: bold;">print</span>(p.x, p[0])
    <span style="color: #ff358b; font-weight: bold;">print</span>(p.y, p[1])
    <span style="color: #ff358b; font-weight: bold;">try</span>:
        <span style="color: #dddd66;">p.x</span> = 2
    <span style="color: #ff358b; font-weight: bold;">except</span> <span style="color: #01b0f0; font-weight: bold;">AttributeError</span> <span style="color: #ff358b; font-weight: bold;">as</span> e:
        <span style="color: #ff358b; font-weight: bold;">print</span>(e)
    <span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'%s %s'</span> % p)
</pre>
</div>

<pre class="example">
&lt;class '__main__.Point'&gt;
2
4 4
5 5
can't set attribute
4 5

</pre>
</div>
</div>


<div id="outline-container-orgd76864f" class="outline-3">
<h3 id="orgd76864f"><span class="section-number-3">1.5</span> 使用元类控制类的创建</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-orgfc4d6ef" class="outline-4">
<h4 id="orgfc4d6ef"><span class="section-number-4">1.5.1</span> 实例缓存</h4>
<div class="outline-text-4" id="text-1-5-1">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #465457;"># </span><span style="color: #465457;">Cached instances</span>

<span style="color: #ff358b; font-weight: bold;">import</span> weakref

<span style="color: #ff358b; font-weight: bold;">class</span> <span style="color: #01b0f0; font-weight: bold;">Cached</span>(<span style="color: #f8fff9;">type</span>):
    <span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">__init__</span>(<span style="color: #ff358b; font-weight: bold;">self</span>, *args, **kwargs):
        <span style="color: #f8fff9;">super</span>().__init__(*args, **kwargs)
        <span style="color: #ff358b; font-weight: bold;">self</span>.__cache = weakref.WeakValueDictionary()

    <span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">__call__</span>(<span style="color: #ff358b; font-weight: bold;">self</span>, *args):
        <span style="color: #ff358b; font-weight: bold;">if</span> args <span style="color: #ff358b; font-weight: bold;">in</span> <span style="color: #ff358b; font-weight: bold;">self</span>.__cache:
            <span style="color: #ff358b; font-weight: bold;">return</span> <span style="color: #ff358b; font-weight: bold;">self</span>.__cache[args]
        <span style="color: #ff358b; font-weight: bold;">else</span>:
            <span style="color: #dddd66;">obj</span> = <span style="color: #f8fff9;">super</span>().__call__(*args)
            <span style="color: #ff358b; font-weight: bold;">self</span>.__cache[args] = obj
            <span style="color: #ff358b; font-weight: bold;">return</span> obj

<span style="color: #ff358b; font-weight: bold;">class</span> <span style="color: #01b0f0; font-weight: bold;">Spam</span>(metaclass=Cached):
    <span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">__init__</span>(<span style="color: #ff358b; font-weight: bold;">self</span>, name):
        <span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'Creating Spam({!r})'</span>.<span style="color: #f8fff9;">format</span>(name))
        <span style="color: #ff358b; font-weight: bold;">self</span>.name = name

<span style="color: #ff358b; font-weight: bold;">if</span> <span style="color: #f8fff9;">__name__</span> == <span style="color: #ffa042;">'__main__'</span>:
    <span style="color: #dddd66;">a</span> = Spam(<span style="color: #ffa042;">'foo'</span>)
    <span style="color: #dddd66;">b</span> = Spam(<span style="color: #ffa042;">'bar'</span>)
    <span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'a is b:'</span>, a <span style="color: #ff358b; font-weight: bold;">is</span> b)
    <span style="color: #dddd66;">c</span> = Spam(<span style="color: #ffa042;">'foo'</span>)
    <span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'a is c:'</span>, a <span style="color: #ff358b; font-weight: bold;">is</span> c)
</pre>
</div>

<pre class="example">
Creating Spam('foo')
Creating Spam('bar')
a is b: False
a is c: True

</pre>
</div>
</div>
