python3/cookbook.org
*** 单例

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  # Singleton

  class Singleton(type):
      def __init__(self, *args, **kwargs):
          self.__instance = None
          super().__init__(*args, **kwargs)

      def __call__(self, *args, **kwargs):
          if self.__instance is None:
              self.__instance = super().__call__(*args, **kwargs)
              return self.__instance
          else:
              return self.__instance

  class Spam(metaclass=Singleton):
      def __init__(self):
          print('Creating Spam')

  if __name__ == '__main__':
      a = Spam()
      b = Spam()
      print(a is b)
#+END_SRC

#+RESULTS:
: Creating Spam
: True


*** 禁用直接实例化

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  # Not allowing direct instantiation

  class NoInstances(type):
      def __call__(self, *args, **kwargs):
          raise TypeError("Can't instantiate directly")

  class Spam(metaclass=NoInstances):
      @staticmethod
      def grok(x):
          print('Spam.grok')

  if __name__ == '__main__':
      try:
          s = Spam()
      except TypeError as e:
          print(e)

      Spam.grok(42)
#+END_SRC

#+RESULTS:
: Can't instantiate directly
: Spam.grok


* 进程与多线程

** 创建子进程

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  from multiprocessing import Process
  import os

  def run_proc(name):
      print('Run child process %s (%s)...' % (name, os.getpid()))

  if __name__=='__main__':
      print('Parent process %s.' % os.getpid())
      p = Process(target=run_proc, args=('test',))
      print('Child process will start.')
      p.start()
      p.join()  # 等待子进程结束后再继续往下运行
      print('Child process end.')
#+END_SRC


** 子进程的输入输出

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  import subprocess

  r = subprocess.call(['nslookup', 'www.python.org'])
  print('r: {}'.format(r))

  p = subprocess.Popen(['nslookup'], stdin=subprocess.PIPE, stdout=subprocess.PIPE, stderr=subprocess.PIPE)
  output, err = p.communicate(b'set q=mx\npython.org\nexit\n')
  print(output.decode('utf-8'))
  print('Exit code:', p.returncode)

  # 相当于在命令行执行命令nslookup，然后手动输入：
  # set q=mx
  # python.org
  # exit
#+END_SRC

#+RESULTS:
#+begin_example
r: 0
Server:		64.104.123.144
Address:	64.104.123.144#53

Non-authoritative answer:
python.org	mail exchanger = 50 mail.python.org.

Authoritative answers can be found from:
org	nameserver = d0.org.afilias-nst.org.
org	nameserver = a2.org.afilias-nst.info.
org	nameserver = a0.org.afilias-nst.info.
org	nameserver = b0.org.afilias-nst.org.
org	nameserver = b2.org.afilias-nst.org.
org	nameserver = c0.org.afilias-nst.info.
a0.org.afilias-nst.info	internet address = 199.19.56.1
a2.org.afilias-nst.info	internet address = 199.249.112.1
b0.org.afilias-nst.org	internet address = 199.19.54.1
b2.org.afilias-nst.org	internet address = 199.249.120.1
c0.org.afilias-nst.info	internet address = 199.19.53.1
d0.org.afilias-nst.org	internet address = 199.19.57.1
a0.org.afilias-nst.info	has AAAA address 2001:500:e::1
a2.org.afilias-nst.info	has AAAA address 2001:500:40::1
b0.org.afilias-nst.org	has AAAA address 2001:500:c::1
b2.org.afilias-nst.org	has AAAA address 2001:500:48::1
c0.org.afilias-nst.info	has AAAA address 2001:500:b::1
d0.org.afilias-nst.org	has AAAA address 2001:500:f::1


Exit code: 0
#+end_example


