python3/cookbook.html


<div id="outline-container-org9f1d677" class="outline-4">
<h4 id="org9f1d677"><span class="section-number-4">1.5.2</span> 单例</h4>
<div class="outline-text-4" id="text-1-5-2">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #465457;"># </span><span style="color: #465457;">Singleton</span>

<span style="color: #ff358b; font-weight: bold;">class</span> <span style="color: #01b0f0; font-weight: bold;">Singleton</span>(<span style="color: #f8fff9;">type</span>):
    <span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">__init__</span>(<span style="color: #ff358b; font-weight: bold;">self</span>, *args, **kwargs):
        <span style="color: #ff358b; font-weight: bold;">self</span>.__instance = <span style="color: #b994ff;">None</span>
        <span style="color: #f8fff9;">super</span>().__init__(*args, **kwargs)

    <span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">__call__</span>(<span style="color: #ff358b; font-weight: bold;">self</span>, *args, **kwargs):
        <span style="color: #ff358b; font-weight: bold;">if</span> <span style="color: #ff358b; font-weight: bold;">self</span>.__instance <span style="color: #ff358b; font-weight: bold;">is</span> <span style="color: #b994ff;">None</span>:
            <span style="color: #ff358b; font-weight: bold;">self</span>.__instance = <span style="color: #f8fff9;">super</span>().__call__(*args, **kwargs)
            <span style="color: #ff358b; font-weight: bold;">return</span> <span style="color: #ff358b; font-weight: bold;">self</span>.__instance
        <span style="color: #ff358b; font-weight: bold;">else</span>:
            <span style="color: #ff358b; font-weight: bold;">return</span> <span style="color: #ff358b; font-weight: bold;">self</span>.__instance

<span style="color: #ff358b; font-weight: bold;">class</span> <span style="color: #01b0f0; font-weight: bold;">Spam</span>(metaclass=Singleton):
    <span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">__init__</span>(<span style="color: #ff358b; font-weight: bold;">self</span>):
        <span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'Creating Spam'</span>)

<span style="color: #ff358b; font-weight: bold;">if</span> <span style="color: #f8fff9;">__name__</span> == <span style="color: #ffa042;">'__main__'</span>:
    <span style="color: #dddd66;">a</span> = Spam()
    <span style="color: #dddd66;">b</span> = Spam()
    <span style="color: #ff358b; font-weight: bold;">print</span>(a <span style="color: #ff358b; font-weight: bold;">is</span> b)
</pre>
</div>

<pre class="example">
Creating Spam
True

</pre>
</div>
</div>


<div id="outline-container-org9a5dfd3" class="outline-4">
<h4 id="org9a5dfd3"><span class="section-number-4">1.5.3</span> 禁用直接实例化</h4>
<div class="outline-text-4" id="text-1-5-3">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #465457;"># </span><span style="color: #465457;">Not allowing direct instantiation</span>

<span style="color: #ff358b; font-weight: bold;">class</span> <span style="color: #01b0f0; font-weight: bold;">NoInstances</span>(<span style="color: #f8fff9;">type</span>):
    <span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">__call__</span>(<span style="color: #ff358b; font-weight: bold;">self</span>, *args, **kwargs):
        <span style="color: #ff358b; font-weight: bold;">raise</span> <span style="color: #01b0f0; font-weight: bold;">TypeError</span>(<span style="color: #ffa042;">"Can't instantiate directly"</span>)

<span style="color: #ff358b; font-weight: bold;">class</span> <span style="color: #01b0f0; font-weight: bold;">Spam</span>(metaclass=NoInstances):
    <span style="color: #01b0f0; font-weight: bold;">@staticmethod</span>
    <span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">grok</span>(x):
        <span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'Spam.grok'</span>)

<span style="color: #ff358b; font-weight: bold;">if</span> <span style="color: #f8fff9;">__name__</span> == <span style="color: #ffa042;">'__main__'</span>:
    <span style="color: #ff358b; font-weight: bold;">try</span>:
        <span style="color: #dddd66;">s</span> = Spam()
    <span style="color: #ff358b; font-weight: bold;">except</span> <span style="color: #01b0f0; font-weight: bold;">TypeError</span> <span style="color: #ff358b; font-weight: bold;">as</span> e:
        <span style="color: #ff358b; font-weight: bold;">print</span>(e)

    Spam.grok(42)
</pre>
</div>

<pre class="example">
Can't instantiate directly
Spam.grok

</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgadf4ca1" class="outline-2">
<h2 id="orgadf4ca1"><span class="section-number-2">2</span> 进程与多线程</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgc889c12" class="outline-3">
<h3 id="orgc889c12"><span class="section-number-3">2.1</span> 创建子进程</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #ff358b; font-weight: bold;">from</span> multiprocessing <span style="color: #ff358b; font-weight: bold;">import</span> Process
<span style="color: #ff358b; font-weight: bold;">import</span> os

<span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">run_proc</span>(name):
    <span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'Run child process %s (%s)...'</span> % (name, os.getpid()))

<span style="color: #ff358b; font-weight: bold;">if</span> <span style="color: #f8fff9;">__name__</span>==<span style="color: #ffa042;">'__main__'</span>:
    <span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'Parent process %s.'</span> % os.getpid())
    <span style="color: #dddd66;">p</span> = Process(target=run_proc, args=(<span style="color: #ffa042;">'test'</span>,))
    <span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'Child process will start.'</span>)
    p.start()
    p.join()  <span style="color: #465457;"># </span><span style="color: #465457;">&#31561;&#24453;&#23376;&#36827;&#31243;&#32467;&#26463;&#21518;&#20877;&#32487;&#32493;&#24448;&#19979;&#36816;&#34892;</span>
    <span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'Child process end.'</span>)
</pre>
</div>
</div>
</div>


<div id="outline-container-orgad82975" class="outline-3">
<h3 id="orgad82975"><span class="section-number-3">2.2</span> 子进程的输入输出</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #ff358b; font-weight: bold;">import</span> subprocess

<span style="color: #dddd66;">r</span> = subprocess.call([<span style="color: #ffa042;">'nslookup'</span>, <span style="color: #ffa042;">'www.python.org'</span>])
<span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'r: {}'</span>.<span style="color: #f8fff9;">format</span>(r))

<span style="color: #dddd66;">p</span> = subprocess.Popen([<span style="color: #ffa042;">'nslookup'</span>], stdin=subprocess.PIPE, stdout=subprocess.PIPE, stderr=subprocess.PIPE)
<span style="color: #dddd66;">output</span>, <span style="color: #dddd66;">err</span> = p.communicate(b<span style="color: #ffa042;">'set q=mx\npython.org\nexit\n'</span>)
<span style="color: #ff358b; font-weight: bold;">print</span>(output.decode(<span style="color: #ffa042;">'utf-8'</span>))
<span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'Exit code:'</span>, p.returncode)

<span style="color: #465457;"># </span><span style="color: #465457;">&#30456;&#24403;&#20110;&#22312;&#21629;&#20196;&#34892;&#25191;&#34892;&#21629;&#20196;nslookup&#65292;&#28982;&#21518;&#25163;&#21160;&#36755;&#20837;&#65306;</span>
<span style="color: #465457;"># </span><span style="color: #465457;">set q=mx</span>
<span style="color: #465457;"># </span><span style="color: #465457;">python.org</span>
<span style="color: #465457;"># </span><span style="color: #465457;">exit</span>
</pre>
</div>

<pre class="example">
r: 0
Server:		64.104.123.144
Address:	64.104.123.144#53

Non-authoritative answer:
python.org	mail exchanger = 50 mail.python.org.

Authoritative answers can be found from:
org	nameserver = d0.org.afilias-nst.org.
org	nameserver = a2.org.afilias-nst.info.
org	nameserver = a0.org.afilias-nst.info.
org	nameserver = b0.org.afilias-nst.org.
org	nameserver = b2.org.afilias-nst.org.
org	nameserver = c0.org.afilias-nst.info.
a0.org.afilias-nst.info	internet address = 199.19.56.1
a2.org.afilias-nst.info	internet address = 199.249.112.1
b0.org.afilias-nst.org	internet address = 199.19.54.1
b2.org.afilias-nst.org	internet address = 199.249.120.1
c0.org.afilias-nst.info	internet address = 199.19.53.1
d0.org.afilias-nst.org	internet address = 199.19.57.1
a0.org.afilias-nst.info	has AAAA address 2001:500:e::1
a2.org.afilias-nst.info	has AAAA address 2001:500:40::1
b0.org.afilias-nst.org	has AAAA address 2001:500:c::1
b2.org.afilias-nst.org	has AAAA address 2001:500:48::1
c0.org.afilias-nst.info	has AAAA address 2001:500:b::1
d0.org.afilias-nst.org	has AAAA address 2001:500:f::1


Exit code: 0
</pre>
</div>
</div>
