python3/cookbook.org
** 进程间通信

父进程中创建两个子进程，一个往 Queue 里写数据，一个从 Queue 里读数据：

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  from multiprocessing import Process, Queue
  import os, time, random

  def write(q):
      print('Process to write: %s' % os.getpid())
      for value in ['A', 'B', 'C']:
          print('Put %s to queue...' % value)
          q.put(value)
          time.sleep(random.random())

  def read(q):
      print('Process to read: %s' % os.getpid())
      while True:
          value = q.get(True)
          print('Get %s from queue.' % value)

  q = Queue()
  pw = Process(target=write, args=(q,))
  pr = Process(target=read, args=(q,))
  pw.start()
  pr.start()
  pw.join()
  pr.terminate()  # pr 进程里是死循环，无法等待其结束，只能强行终止:
#+END_SRC

#+RESULTS:
: Process to write: 92549
: Put A to queue...
: Process to read: 92550
: Get A from queue.
: Put B to queue...
: Get B from queue.
: Put C to queue...
: Get C from queue.


** 创建线程

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  import time, threading

  def worker():
      print('thread %s is running...' % threading.current_thread().name)
      time.sleep(1)
      print('thread %s ended.' % threading.current_thread().name)

  t = threading.Thread(target=worker, name='WorkerThread')
  t.start()
  t.join()
#+END_SRC

#+RESULTS:
: thread WorkerThread is running...
: thread WorkerThread ended.


** 线程加锁

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  import threading
  from concurrent.futures import ThreadPoolExecutor

  lock = threading.Lock()
  count = 0

  def run_thread_without_lock():
      global count
      while count < 10:
          count += 1
          print("%s, " % count, end='')

  def run_thread_with_lock():
      global count
      with lock:
          while count < 10:
              count += 1
              print("%s, " % count, end='')

  with ThreadPoolExecutor(max_workers=4) as executor:
      for i in range(5):
          executor.submit(run_thread_without_lock)

  count = 0

  with ThreadPoolExecutor(max_workers=4) as executor:
      for i in range(5):
          executor.submit(run_thread_with_lock)
#+END_SRC

#+RESULTS:
: 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10,


** thread local 变量

一个线程使用自己的局部变量比使用全局变量好，因为局部变量只有线程自己能看见，不会影响其他线程，而全局变量的修改必须加锁。

最常用的地方就是为每个线程绑定一个数据库连接，HTTP 请求，用户身份信息等，这样一个线程的所有调用到的处理函数都可以非常方便地访问这些资源。

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  import threading, time

  tl = threading.local()

  def worker(name):
      tl.name = name
      time.sleep(3)
      print("in thread:", tl.name)

  t = threading.Thread(target=worker, args=("hello",), name='Thread-A')
  t.start()
  tl.name = 'world'
  print("in main:", tl.name)
#+END_SRC

#+RESULTS:
: in main: world


** 线程池

#+BEGIN_SRC ipython
  from concurrent.futures import ThreadPoolExecutor
  import urllib.request

  def fetch_url(url):
      u = urllib.request.urlopen(url)
      data = u.read()
      return data

  pool = ThreadPoolExecutor(10)
  # Submit work to the pool
  a = pool.submit(fetch_url, 'http://www.python.org')
  b = pool.submit(fetch_url, 'http://www.pypy.org')

  # Get the results back
  x = a.result()
  y = b.result()
#+END_SRC

#+RESULTS:
: # Out[1]:


* 数据结构

** 列表

*** 列表中删除数据的陷阱

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  lst = ['a', 'b', 'c', '', '']
  for i in lst:
      if i is '':
          lst.remove(i)

  print(lst)
#+END_SRC

#+RESULTS:
: ['a', 'b', 'c', '']

**** 原理

list 属于线性表，它的连续在于用一块连续的内存空间存储元素，在调用 =remove= 时，只是删除了地址内的元素。

回到问题，当删除列表中的元素时， =for in= 是对下标进行操作，而 =remove= 是对值进行操作, 当 =for= 到达索引为 3 ，即第一个空字符位置时，符合条件即删除。因为 list 是线性表，所以删除这个空字符时， *同时后面的所有元素自动移动位置 1* ，此时的 lst 等于 =['a', 'b', 'c', '']= ，因为 =for in= 已经遍历到了索引 3 处，所以循环结束。

