python3/cookbook.html


<div id="outline-container-orga313918" class="outline-3">
<h3 id="orga313918"><span class="section-number-3">2.3</span> 进程间通信</h3>
<div class="outline-text-3" id="text-2-3">
<p>
父进程中创建两个子进程，一个往 Queue 里写数据，一个从 Queue 里读数据：
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #ff358b; font-weight: bold;">from</span> multiprocessing <span style="color: #ff358b; font-weight: bold;">import</span> Process, Queue
<span style="color: #ff358b; font-weight: bold;">import</span> os, time, random

<span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">write</span>(q):
    <span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'Process to write: %s'</span> % os.getpid())
    <span style="color: #ff358b; font-weight: bold;">for</span> value <span style="color: #ff358b; font-weight: bold;">in</span> [<span style="color: #ffa042;">'A'</span>, <span style="color: #ffa042;">'B'</span>, <span style="color: #ffa042;">'C'</span>]:
        <span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'Put %s to queue...'</span> % value)
        q.put(value)
        time.sleep(random.random())

<span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">read</span>(q):
    <span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'Process to read: %s'</span> % os.getpid())
    <span style="color: #ff358b; font-weight: bold;">while</span> <span style="color: #b994ff;">True</span>:
        <span style="color: #dddd66;">value</span> = q.get(<span style="color: #b994ff;">True</span>)
        <span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'Get %s from queue.'</span> % value)

<span style="color: #dddd66;">q</span> = Queue()
<span style="color: #dddd66;">pw</span> = Process(target=write, args=(q,))
<span style="color: #dddd66;">pr</span> = Process(target=read, args=(q,))
pw.start()
pr.start()
pw.join()
pr.terminate()  <span style="color: #465457;"># </span><span style="color: #465457;">pr &#36827;&#31243;&#37324;&#26159;&#27515;&#24490;&#29615;&#65292;&#26080;&#27861;&#31561;&#24453;&#20854;&#32467;&#26463;&#65292;&#21482;&#33021;&#24378;&#34892;&#32456;&#27490;:</span>
</pre>
</div>

<pre class="example">
Process to write: 92549
Put A to queue...
Process to read: 92550
Get A from queue.
Put B to queue...
Get B from queue.
Put C to queue...
Get C from queue.

</pre>
</div>
</div>


<div id="outline-container-orgae578f0" class="outline-3">
<h3 id="orgae578f0"><span class="section-number-3">2.4</span> 创建线程</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #ff358b; font-weight: bold;">import</span> time, threading

<span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">worker</span>():
    <span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'thread %s is running...'</span> % threading.current_thread().name)
    time.sleep(1)
    <span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'thread %s ended.'</span> % threading.current_thread().name)

<span style="color: #dddd66;">t</span> = threading.Thread(target=worker, name=<span style="color: #ffa042;">'WorkerThread'</span>)
t.start()
t.join()
</pre>
</div>

<pre class="example">
thread WorkerThread is running...
thread WorkerThread ended.

</pre>
</div>
</div>


<div id="outline-container-org119d5bf" class="outline-3">
<h3 id="org119d5bf"><span class="section-number-3">2.5</span> 线程加锁</h3>
<div class="outline-text-3" id="text-2-5">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #ff358b; font-weight: bold;">import</span> threading
<span style="color: #ff358b; font-weight: bold;">from</span> concurrent.futures <span style="color: #ff358b; font-weight: bold;">import</span> ThreadPoolExecutor

<span style="color: #dddd66;">lock</span> = threading.Lock()
<span style="color: #dddd66;">count</span> = 0

<span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">run_thread_without_lock</span>():
    <span style="color: #ff358b; font-weight: bold;">global</span> count
    <span style="color: #ff358b; font-weight: bold;">while</span> count &lt; 10:
        <span style="color: #dddd66;">count</span> += 1
        <span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">"%s, "</span> % count, end=<span style="color: #ffa042;">''</span>)

<span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">run_thread_with_lock</span>():
    <span style="color: #ff358b; font-weight: bold;">global</span> count
    <span style="color: #ff358b; font-weight: bold;">with</span> lock:
        <span style="color: #ff358b; font-weight: bold;">while</span> count &lt; 10:
            <span style="color: #dddd66;">count</span> += 1
            <span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">"%s, "</span> % count, end=<span style="color: #ffa042;">''</span>)

<span style="color: #ff358b; font-weight: bold;">with</span> ThreadPoolExecutor(max_workers=4) <span style="color: #ff358b; font-weight: bold;">as</span> executor:
    <span style="color: #ff358b; font-weight: bold;">for</span> i <span style="color: #ff358b; font-weight: bold;">in</span> <span style="color: #f8fff9;">range</span>(5):
        executor.submit(run_thread_without_lock)

<span style="color: #dddd66;">count</span> = 0

<span style="color: #ff358b; font-weight: bold;">with</span> ThreadPoolExecutor(max_workers=4) <span style="color: #ff358b; font-weight: bold;">as</span> executor:
    <span style="color: #ff358b; font-weight: bold;">for</span> i <span style="color: #ff358b; font-weight: bold;">in</span> <span style="color: #f8fff9;">range</span>(5):
        executor.submit(run_thread_with_lock)
</pre>
</div>

<pre class="example">
1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10,

</pre>
</div>
</div>


<div id="outline-container-org4a865f9" class="outline-3">
<h3 id="org4a865f9"><span class="section-number-3">2.6</span> thread local 变量</h3>
<div class="outline-text-3" id="text-2-6">
<p>
一个线程使用自己的局部变量比使用全局变量好，因为局部变量只有线程自己能看见，不会影响其他线程，而全局变量的修改必须加锁。
</p>

<p>
最常用的地方就是为每个线程绑定一个数据库连接，HTTP 请求，用户身份信息等，这样一个线程的所有调用到的处理函数都可以非常方便地访问这些资源。
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #ff358b; font-weight: bold;">import</span> threading, time

<span style="color: #dddd66;">tl</span> = threading.local()

<span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">worker</span>(name):
    <span style="color: #dddd66;">tl.name</span> = name
    time.sleep(3)
    <span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">"in thread:"</span>, tl.name)

<span style="color: #dddd66;">t</span> = threading.Thread(target=worker, args=(<span style="color: #ffa042;">"hello"</span>,), name=<span style="color: #ffa042;">'Thread-A'</span>)
t.start()
<span style="color: #dddd66;">tl.name</span> = <span style="color: #ffa042;">'world'</span>
<span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">"in main:"</span>, tl.name)
</pre>
</div>

<pre class="example">
in main: world

</pre>
</div>
</div>


<div id="outline-container-org39e675d" class="outline-3">
<h3 id="org39e675d"><span class="section-number-3">2.7</span> 线程池</h3>
<div class="outline-text-3" id="text-2-7">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #ff358b; font-weight: bold;">from</span> concurrent.futures <span style="color: #ff358b; font-weight: bold;">import</span> ThreadPoolExecutor
<span style="color: #ff358b; font-weight: bold;">import</span> urllib.request

<span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">fetch_url</span>(url):
    <span style="color: #dddd66;">u</span> = urllib.request.urlopen(url)
    <span style="color: #dddd66;">data</span> = u.read()
    <span style="color: #ff358b; font-weight: bold;">return</span> data

<span style="color: #dddd66;">pool</span> = ThreadPoolExecutor(10)
<span style="color: #465457;"># </span><span style="color: #465457;">Submit work to the pool</span>
<span style="color: #dddd66;">a</span> = pool.submit(fetch_url, <span style="color: #ffa042;">'http://www.python.org'</span>)
<span style="color: #dddd66;">b</span> = pool.submit(fetch_url, <span style="color: #ffa042;">'http://www.pypy.org'</span>)

<span style="color: #465457;"># </span><span style="color: #465457;">Get the results back</span>
<span style="color: #dddd66;">x</span> = a.result()
<span style="color: #dddd66;">y</span> = b.result()
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org85ef7e2" class="outline-2">
<h2 id="org85ef7e2"><span class="section-number-2">3</span> 数据结构</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org958cf15" class="outline-3">
<h3 id="org958cf15"><span class="section-number-3">3.1</span> 列表</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-orge6a4ac3" class="outline-4">
<h4 id="orge6a4ac3"><span class="section-number-4">3.1.1</span> 列表中删除数据的陷阱</h4>
<div class="outline-text-4" id="text-3-1-1">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #dddd66;">lst</span> = [<span style="color: #ffa042;">'a'</span>, <span style="color: #ffa042;">'b'</span>, <span style="color: #ffa042;">'c'</span>, <span style="color: #ffa042;">''</span>, <span style="color: #ffa042;">''</span>]
<span style="color: #ff358b; font-weight: bold;">for</span> i <span style="color: #ff358b; font-weight: bold;">in</span> lst:
    <span style="color: #ff358b; font-weight: bold;">if</span> i <span style="color: #ff358b; font-weight: bold;">is</span> <span style="color: #ffa042;">''</span>:
        lst.remove(i)

<span style="color: #ff358b; font-weight: bold;">print</span>(lst)
</pre>
</div>

<pre class="example">
['a', 'b', 'c', '']

</pre>
</div>

<div id="outline-container-org34339c1" class="outline-5">
<h5 id="org34339c1"><span class="section-number-5">3.1.1.1</span> 原理</h5>
<div class="outline-text-5" id="text-3-1-1-1">
<p>
list 属于线性表，它的连续在于用一块连续的内存空间存储元素，在调用 <code>remove</code> 时，只是删除了地址内的元素。
</p>

<p>
回到问题，当删除列表中的元素时， <code>for in</code> 是对下标进行操作，而 <code>remove</code> 是对值进行操作, 当 <code>for</code> 到达索引为 3 ，即第一个空字符位置时，符合条件即删除。因为 list 是线性表，所以删除这个空字符时， <b>同时后面的所有元素自动移动位置 1</b> ，此时的 lst 等于 <code>['a', 'b', 'c', '']</code> ，因为 <code>for in</code> 已经遍历到了索引 3 处，所以循环结束。
</p>
</div>
</div>
