python3/cookbook.org
**** 解决方法

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export

  lst = ['a','','b','','c','','']

  # 做法一
  while '' in lst:
      lst.remove('')
  print(lst)


  # 做法二

  lst_new = [i for i in lst if i != '']
#+END_SRC


*** 列表中出现频率最高

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  words = [
     'look', 'into', 'my', 'eyes', 'look', 'into', 'my', 'eyes',
     'the', 'eyes', 'the', 'eyes', 'the', 'eyes', 'not', 'around', 'the',
     'eyes', "don't", 'look', 'around', 'the', 'eyes', 'look', 'into',
     'my', 'eyes', "you're", 'under'
  ]

  from collections import Counter
  word_counts = Counter(words)
  top_three = word_counts.most_common(3)
  print(top_three)
#+END_SRC

#+RESULTS:
: [('eyes', 8), ('the', 5), ('look', 4)]


*** 列表中最大或最小的几项

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  import heapq

  portfolio = [
     {'name': 'IBM', 'shares': 100, 'price': 91.1},
     {'name': 'AAPL', 'shares': 50, 'price': 543.22},
     {'name': 'FB', 'shares': 200, 'price': 21.09},
     {'name': 'HPQ', 'shares': 35, 'price': 31.75},
     {'name': 'YHOO', 'shares': 45, 'price': 16.35},
     {'name': 'ACME', 'shares': 75, 'price': 115.65}
  ]

  cheap = heapq.nsmallest(3, portfolio, key=lambda s: s['price'])
  expensive = heapq.nlargest(3, portfolio, key=lambda s: s['price'])
  r = {'cheap': cheap, 'expensive': expensive}
  print(r)
#+END_SRC


*** 对列表中的数据分组

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export :eval never-export
  rows = [
      {'address': '5412 N CLARK', 'date': '07/01/2012'},
      {'address': '5148 N CLARK', 'date': '07/04/2012'},
      {'address': '5800 E 58TH', 'date': '07/02/2012'},
      {'address': '2122 N CLARK', 'date': '07/03/2012'},
      {'address': '5645 N RAVENSWOOD', 'date': '07/02/2012'},
      {'address': '1060 W ADDISON', 'date': '07/02/2012'},
      {'address': '4801 N BROADWAY', 'date': '07/01/2012'},
      {'address': '1039 W GRANVILLE', 'date': '07/04/2012'},
  ]

  from itertools import groupby

  rows.sort(key=lambda r: r['date'])
  for date, items in groupby(rows, key=lambda r: r['date']):
      print(date)
      for i in items:
          print('    ', i)
#+END_SRC

#+RESULTS:
#+begin_example
07/01/2012
     {'address': '5412 N CLARK', 'date': '07/01/2012'}
     {'address': '4801 N BROADWAY', 'date': '07/01/2012'}
07/02/2012
     {'address': '5800 E 58TH', 'date': '07/02/2012'}
     {'address': '5645 N RAVENSWOOD', 'date': '07/02/2012'}
     {'address': '1060 W ADDISON', 'date': '07/02/2012'}
07/03/2012
     {'address': '2122 N CLARK', 'date': '07/03/2012'}
07/04/2012
     {'address': '5148 N CLARK', 'date': '07/04/2012'}
     {'address': '1039 W GRANVILLE', 'date': '07/04/2012'}
#+end_example

或者使用 defaultdict 来实现：

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  from collections import defaultdict
  rows_by_date = defaultdict(list)
  for row in rows:
      rows_by_date[row['date']].append(row)
  print(rows_by_date)
#+END_SRC

#+RESULTS:
: defaultdict(<class 'list'>, {'07/01/2012': [{'address': '5412 N CLARK', 'date': '07/01/2012'}, {'address': '4801 N BROADWAY', 'date': '07/01/2012'}], '07/02/2012': [{'address': '5800 E 58TH', 'date': '07/02/2012'}, {'address': '5645 N RAVENSWOOD', 'date': '07/02/2012'}, {'address': '1060 W ADDISON', 'date': '07/02/2012'}], '07/03/2012': [{'address': '2122 N CLARK', 'date': '07/03/2012'}], '07/04/2012': [{'address': '5148 N CLARK', 'date': '07/04/2012'}, {'address': '1039 W GRANVILLE', 'date': '07/04/2012'}]})


