python3/cookbook.html

<div id="outline-container-org1073f50" class="outline-5">
<h5 id="org1073f50"><span class="section-number-5">3.1.1.2</span> 解决方法</h5>
<div class="outline-text-5" id="text-3-1-1-2">
<div class="org-src-container">
<pre class="src src-ipython">
<span style="color: #dddd66;">lst</span> = [<span style="color: #ffa042;">'a'</span>,<span style="color: #ffa042;">''</span>,<span style="color: #ffa042;">'b'</span>,<span style="color: #ffa042;">''</span>,<span style="color: #ffa042;">'c'</span>,<span style="color: #ffa042;">''</span>,<span style="color: #ffa042;">''</span>]

<span style="color: #465457;"># </span><span style="color: #465457;">&#20570;&#27861;&#19968;</span>
<span style="color: #ff358b; font-weight: bold;">while</span> <span style="color: #ffa042;">''</span> <span style="color: #ff358b; font-weight: bold;">in</span> lst:
    lst.remove(<span style="color: #ffa042;">''</span>)
<span style="color: #ff358b; font-weight: bold;">print</span>(lst)


<span style="color: #465457;"># </span><span style="color: #465457;">&#20570;&#27861;&#20108;</span>

<span style="color: #dddd66;">lst_new</span> = [i <span style="color: #ff358b; font-weight: bold;">for</span> i <span style="color: #ff358b; font-weight: bold;">in</span> lst <span style="color: #ff358b; font-weight: bold;">if</span> i != <span style="color: #ffa042;">''</span>]
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgf72c3c3" class="outline-4">
<h4 id="orgf72c3c3"><span class="section-number-4">3.1.2</span> 列表中出现频率最高</h4>
<div class="outline-text-4" id="text-3-1-2">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #dddd66;">words</span> = [
   <span style="color: #ffa042;">'look'</span>, <span style="color: #ffa042;">'into'</span>, <span style="color: #ffa042;">'my'</span>, <span style="color: #ffa042;">'eyes'</span>, <span style="color: #ffa042;">'look'</span>, <span style="color: #ffa042;">'into'</span>, <span style="color: #ffa042;">'my'</span>, <span style="color: #ffa042;">'eyes'</span>,
   <span style="color: #ffa042;">'the'</span>, <span style="color: #ffa042;">'eyes'</span>, <span style="color: #ffa042;">'the'</span>, <span style="color: #ffa042;">'eyes'</span>, <span style="color: #ffa042;">'the'</span>, <span style="color: #ffa042;">'eyes'</span>, <span style="color: #ffa042;">'not'</span>, <span style="color: #ffa042;">'around'</span>, <span style="color: #ffa042;">'the'</span>,
   <span style="color: #ffa042;">'eyes'</span>, <span style="color: #ffa042;">"don't"</span>, <span style="color: #ffa042;">'look'</span>, <span style="color: #ffa042;">'around'</span>, <span style="color: #ffa042;">'the'</span>, <span style="color: #ffa042;">'eyes'</span>, <span style="color: #ffa042;">'look'</span>, <span style="color: #ffa042;">'into'</span>,
   <span style="color: #ffa042;">'my'</span>, <span style="color: #ffa042;">'eyes'</span>, <span style="color: #ffa042;">"you're"</span>, <span style="color: #ffa042;">'under'</span>
]

<span style="color: #ff358b; font-weight: bold;">from</span> collections <span style="color: #ff358b; font-weight: bold;">import</span> Counter
<span style="color: #dddd66;">word_counts</span> = Counter(words)
<span style="color: #dddd66;">top_three</span> = word_counts.most_common(3)
<span style="color: #ff358b; font-weight: bold;">print</span>(top_three)
</pre>
</div>

<pre class="example">
[('eyes', 8), ('the', 5), ('look', 4)]

</pre>
</div>
</div>


<div id="outline-container-org5ffbd1f" class="outline-4">
<h4 id="org5ffbd1f"><span class="section-number-4">3.1.3</span> 列表中最大或最小的几项</h4>
<div class="outline-text-4" id="text-3-1-3">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #ff358b; font-weight: bold;">import</span> heapq

<span style="color: #dddd66;">portfolio</span> = [
   {<span style="color: #ffa042;">'name'</span>: <span style="color: #ffa042;">'IBM'</span>, <span style="color: #ffa042;">'shares'</span>: 100, <span style="color: #ffa042;">'price'</span>: 91.1},
   {<span style="color: #ffa042;">'name'</span>: <span style="color: #ffa042;">'AAPL'</span>, <span style="color: #ffa042;">'shares'</span>: 50, <span style="color: #ffa042;">'price'</span>: 543.22},
   {<span style="color: #ffa042;">'name'</span>: <span style="color: #ffa042;">'FB'</span>, <span style="color: #ffa042;">'shares'</span>: 200, <span style="color: #ffa042;">'price'</span>: 21.09},
   {<span style="color: #ffa042;">'name'</span>: <span style="color: #ffa042;">'HPQ'</span>, <span style="color: #ffa042;">'shares'</span>: 35, <span style="color: #ffa042;">'price'</span>: 31.75},
   {<span style="color: #ffa042;">'name'</span>: <span style="color: #ffa042;">'YHOO'</span>, <span style="color: #ffa042;">'shares'</span>: 45, <span style="color: #ffa042;">'price'</span>: 16.35},
   {<span style="color: #ffa042;">'name'</span>: <span style="color: #ffa042;">'ACME'</span>, <span style="color: #ffa042;">'shares'</span>: 75, <span style="color: #ffa042;">'price'</span>: 115.65}
]

<span style="color: #dddd66;">cheap</span> = heapq.nsmallest(3, portfolio, key=<span style="color: #ff358b; font-weight: bold;">lambda</span> s: s[<span style="color: #ffa042;">'price'</span>])
<span style="color: #dddd66;">expensive</span> = heapq.nlargest(3, portfolio, key=<span style="color: #ff358b; font-weight: bold;">lambda</span> s: s[<span style="color: #ffa042;">'price'</span>])
<span style="color: #dddd66;">r</span> = {<span style="color: #ffa042;">'cheap'</span>: cheap, <span style="color: #ffa042;">'expensive'</span>: expensive}
<span style="color: #ff358b; font-weight: bold;">print</span>(r)
</pre>
</div>
</div>
</div>


<div id="outline-container-org39a1da7" class="outline-4">
<h4 id="org39a1da7"><span class="section-number-4">3.1.4</span> 对列表中的数据分组</h4>
<div class="outline-text-4" id="text-3-1-4">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #dddd66;">rows</span> = [
    {<span style="color: #ffa042;">'address'</span>: <span style="color: #ffa042;">'5412 N CLARK'</span>, <span style="color: #ffa042;">'date'</span>: <span style="color: #ffa042;">'07/01/2012'</span>},
    {<span style="color: #ffa042;">'address'</span>: <span style="color: #ffa042;">'5148 N CLARK'</span>, <span style="color: #ffa042;">'date'</span>: <span style="color: #ffa042;">'07/04/2012'</span>},
    {<span style="color: #ffa042;">'address'</span>: <span style="color: #ffa042;">'5800 E 58TH'</span>, <span style="color: #ffa042;">'date'</span>: <span style="color: #ffa042;">'07/02/2012'</span>},
    {<span style="color: #ffa042;">'address'</span>: <span style="color: #ffa042;">'2122 N CLARK'</span>, <span style="color: #ffa042;">'date'</span>: <span style="color: #ffa042;">'07/03/2012'</span>},
    {<span style="color: #ffa042;">'address'</span>: <span style="color: #ffa042;">'5645 N RAVENSWOOD'</span>, <span style="color: #ffa042;">'date'</span>: <span style="color: #ffa042;">'07/02/2012'</span>},
    {<span style="color: #ffa042;">'address'</span>: <span style="color: #ffa042;">'1060 W ADDISON'</span>, <span style="color: #ffa042;">'date'</span>: <span style="color: #ffa042;">'07/02/2012'</span>},
    {<span style="color: #ffa042;">'address'</span>: <span style="color: #ffa042;">'4801 N BROADWAY'</span>, <span style="color: #ffa042;">'date'</span>: <span style="color: #ffa042;">'07/01/2012'</span>},
    {<span style="color: #ffa042;">'address'</span>: <span style="color: #ffa042;">'1039 W GRANVILLE'</span>, <span style="color: #ffa042;">'date'</span>: <span style="color: #ffa042;">'07/04/2012'</span>},
]

<span style="color: #ff358b; font-weight: bold;">from</span> itertools <span style="color: #ff358b; font-weight: bold;">import</span> groupby

rows.sort(key=<span style="color: #ff358b; font-weight: bold;">lambda</span> r: r[<span style="color: #ffa042;">'date'</span>])
<span style="color: #ff358b; font-weight: bold;">for</span> date, items <span style="color: #ff358b; font-weight: bold;">in</span> groupby(rows, key=<span style="color: #ff358b; font-weight: bold;">lambda</span> r: r[<span style="color: #ffa042;">'date'</span>]):
    <span style="color: #ff358b; font-weight: bold;">print</span>(date)
    <span style="color: #ff358b; font-weight: bold;">for</span> i <span style="color: #ff358b; font-weight: bold;">in</span> items:
        <span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'    '</span>, i)
</pre>
</div>

<pre class="example">
07/01/2012
     {'address': '5412 N CLARK', 'date': '07/01/2012'}
     {'address': '4801 N BROADWAY', 'date': '07/01/2012'}
07/02/2012
     {'address': '5800 E 58TH', 'date': '07/02/2012'}
     {'address': '5645 N RAVENSWOOD', 'date': '07/02/2012'}
     {'address': '1060 W ADDISON', 'date': '07/02/2012'}
07/03/2012
     {'address': '2122 N CLARK', 'date': '07/03/2012'}
07/04/2012
     {'address': '5148 N CLARK', 'date': '07/04/2012'}
     {'address': '1039 W GRANVILLE', 'date': '07/04/2012'}
</pre>

<p>
或者使用 defaultdict 来实现：
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #ff358b; font-weight: bold;">from</span> collections <span style="color: #ff358b; font-weight: bold;">import</span> defaultdict
<span style="color: #dddd66;">rows_by_date</span> = defaultdict(<span style="color: #f8fff9;">list</span>)
<span style="color: #ff358b; font-weight: bold;">for</span> row <span style="color: #ff358b; font-weight: bold;">in</span> rows:
    rows_by_date[row[<span style="color: #ffa042;">'date'</span>]].append(row)
<span style="color: #ff358b; font-weight: bold;">print</span>(rows_by_date)
</pre>
</div>

<pre class="example">
defaultdict(&lt;class 'list'&gt;, {'07/01/2012': [{'address': '5412 N CLARK', 'date': '07/01/2012'}, {'address': '4801 N BROADWAY', 'date': '07/01/2012'}], '07/02/2012': [{'address': '5800 E 58TH', 'date': '07/02/2012'}, {'address': '5645 N RAVENSWOOD', 'date': '07/02/2012'}, {'address': '1060 W ADDISON', 'date': '07/02/2012'}], '07/03/2012': [{'address': '2122 N CLARK', 'date': '07/03/2012'}], '07/04/2012': [{'address': '5148 N CLARK', 'date': '07/04/2012'}, {'address': '1039 W GRANVILLE', 'date': '07/04/2012'}]})

</pre>
</div>
</div>
