python3/cookbook.org
*** 消除序列中的重复数据，同时保持数据顺序

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  def dedupe(items, key=None):
      seen = set()
      for item in items:
          val = item if key is None else key(item)
          if val not in seen:
              yield item
              seen.add(val)


  a = [
          {'x': 2, 'y': 3},
          {'x': 1, 'y': 4},
          {'x': 2, 'y': 3},
          {'x': 2, 'y': 3},
          {'x': 10, 'y': 15}
      ]
  print(list(dedupe(a, key=lambda a: (a['x'],a['y']))))
#+END_SRC

#+RESULTS:
: [{'x': 2, 'y': 3}, {'x': 1, 'y': 4}, {'x': 10, 'y': 15}]


#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  def dedupe(items):
      seen = set()
      for item in items:
          if item not in seen:
              yield item
              seen.add(item)

  a = [1, 5, 2, 1, 9, 1, 5, 10]
  print(list(dedupe(a)))
#+END_SRC

#+RESULTS:
: [1, 5, 2, 9, 10]


*** 序列解包 (unpack)

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  records = [
       ('foo', 1, 2),
       ('bar', 'hello'),
       ('foo', 3, 4),
  ]

  def do_foo(x,y):
      print('foo', x, y)

  def do_bar(s):
      print('bar', s)

  for tag, *args in records:
      if tag == 'foo':
          do_foo(*args)
      elif tag == 'bar':
          do_bar(*args)
#+END_SRC

#+RESULTS:
: foo 1 2
: bar hello
: foo 3 4


*** flatten 列表

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  from collections import Iterable

  def flatten(items, ignore_types=(str, bytes)):
      for x in items:
          if isinstance(x, Iterable) and not isinstance(x, ignore_types):
              yield from flatten(x)
          else:
              yield x

  items = [1, 2, [3, 4, [5, 6], 7], 8]

  # Produces 1 2 3 4 5 6 7 8
  for x in flatten(items):
      print(x)

  items = ['Dave', 'Paula', ['Thomas', 'Lewis']]
  for x in flatten(items):
      print(x)

#+END_SRC

#+RESULTS:
#+begin_example
1
2
3
4
5
6
7
8
Dave
Paula
Thomas
Lewis
#+end_example


** 字典

*** 对字典作集合运算

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  a = {
     'x' : 1,
     'y' : 2,
     'z' : 3
  }

  b = {
     'w' : 10,
     'x' : 11,
     'y' : 2
  }

  print('Common keys:', a.keys() & b.keys())
  print('Keys in a not in b:', a.keys() - b.keys())
  print('(key,value) pairs in common:', a.items() & b.items())
#+END_SRC

#+RESULTS:
: Common keys: {'y', 'x'}
: Keys in a not in b: {'z'}
: (key,value) pairs in common: {('y', 2)}


*** 组合多个字典当作一个字典使用

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  a = {'x': 1, 'z': 3 }
  b = {'y': 2, 'z': 4 }

  # (a) Simple example of combining
  from collections import ChainMap
  c = ChainMap(a,b)

  print("c:", c)

  print(c['x'])      # Outputs 1  (from a)
  print(c['y'])      # Outputs 2  (from b)
  print(c['z'])      # Outputs 3  (from a)

  # Output some common values
  print('len(c):', len(c))
  print('c.keys():', list(c.keys()))
  print('c.values():', list(c.values()))

  # Modify some values
  c['z'] = 10
  c['w'] = 40
  del c['x']
  print("a:", a)
#+END_SRC

#+RESULTS:
: c: ChainMap({'x': 1, 'z': 3}, {'y': 2, 'z': 4})
: 1
: 2
: 3
: len(c): 3
: c.keys(): ['z', 'y', 'x']
: c.values(): [3, 2, 1]
: a: {'z': 10, 'w': 40}


