python3/cookbook.html


<div id="outline-container-orgbe8eca1" class="outline-4">
<h4 id="orgbe8eca1"><span class="section-number-4">3.1.5</span> 消除序列中的重复数据，同时保持数据顺序</h4>
<div class="outline-text-4" id="text-3-1-5">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">dedupe</span>(items, key=<span style="color: #b994ff;">None</span>):
    <span style="color: #dddd66;">seen</span> = <span style="color: #f8fff9;">set</span>()
    <span style="color: #ff358b; font-weight: bold;">for</span> item <span style="color: #ff358b; font-weight: bold;">in</span> items:
        <span style="color: #dddd66;">val</span> = item <span style="color: #ff358b; font-weight: bold;">if</span> key <span style="color: #ff358b; font-weight: bold;">is</span> <span style="color: #b994ff;">None</span> <span style="color: #ff358b; font-weight: bold;">else</span> key(item)
        <span style="color: #ff358b; font-weight: bold;">if</span> val <span style="color: #ff358b; font-weight: bold;">not</span> <span style="color: #ff358b; font-weight: bold;">in</span> seen:
            <span style="color: #ff358b; font-weight: bold;">yield</span> item
            seen.add(val)


<span style="color: #dddd66;">a</span> = [
        {<span style="color: #ffa042;">'x'</span>: 2, <span style="color: #ffa042;">'y'</span>: 3},
        {<span style="color: #ffa042;">'x'</span>: 1, <span style="color: #ffa042;">'y'</span>: 4},
        {<span style="color: #ffa042;">'x'</span>: 2, <span style="color: #ffa042;">'y'</span>: 3},
        {<span style="color: #ffa042;">'x'</span>: 2, <span style="color: #ffa042;">'y'</span>: 3},
        {<span style="color: #ffa042;">'x'</span>: 10, <span style="color: #ffa042;">'y'</span>: 15}
    ]
<span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #f8fff9;">list</span>(dedupe(a, key=<span style="color: #ff358b; font-weight: bold;">lambda</span> a: (a[<span style="color: #ffa042;">'x'</span>],a[<span style="color: #ffa042;">'y'</span>]))))
</pre>
</div>

<pre class="example">
[{'x': 2, 'y': 3}, {'x': 1, 'y': 4}, {'x': 10, 'y': 15}]

</pre>


<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">dedupe</span>(items):
    <span style="color: #dddd66;">seen</span> = <span style="color: #f8fff9;">set</span>()
    <span style="color: #ff358b; font-weight: bold;">for</span> item <span style="color: #ff358b; font-weight: bold;">in</span> items:
        <span style="color: #ff358b; font-weight: bold;">if</span> item <span style="color: #ff358b; font-weight: bold;">not</span> <span style="color: #ff358b; font-weight: bold;">in</span> seen:
            <span style="color: #ff358b; font-weight: bold;">yield</span> item
            seen.add(item)

<span style="color: #dddd66;">a</span> = [1, 5, 2, 1, 9, 1, 5, 10]
<span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #f8fff9;">list</span>(dedupe(a)))
</pre>
</div>

<pre class="example">
[1, 5, 2, 9, 10]

</pre>
</div>
</div>


<div id="outline-container-org2dbc102" class="outline-4">
<h4 id="org2dbc102"><span class="section-number-4">3.1.6</span> 序列解包 (unpack)</h4>
<div class="outline-text-4" id="text-3-1-6">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #dddd66;">records</span> = [
     (<span style="color: #ffa042;">'foo'</span>, 1, 2),
     (<span style="color: #ffa042;">'bar'</span>, <span style="color: #ffa042;">'hello'</span>),
     (<span style="color: #ffa042;">'foo'</span>, 3, 4),
]

<span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">do_foo</span>(x,y):
    <span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'foo'</span>, x, y)

<span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">do_bar</span>(s):
    <span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'bar'</span>, s)

<span style="color: #ff358b; font-weight: bold;">for</span> tag, *args <span style="color: #ff358b; font-weight: bold;">in</span> records:
    <span style="color: #ff358b; font-weight: bold;">if</span> tag == <span style="color: #ffa042;">'foo'</span>:
        do_foo(*args)
    <span style="color: #ff358b; font-weight: bold;">elif</span> tag == <span style="color: #ffa042;">'bar'</span>:
        do_bar(*args)
</pre>
</div>

<pre class="example">
foo 1 2
bar hello
foo 3 4

</pre>
</div>
</div>


<div id="outline-container-org0de15bd" class="outline-4">
<h4 id="org0de15bd"><span class="section-number-4">3.1.7</span> flatten 列表</h4>
<div class="outline-text-4" id="text-3-1-7">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #ff358b; font-weight: bold;">from</span> collections <span style="color: #ff358b; font-weight: bold;">import</span> Iterable

<span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">flatten</span>(items, ignore_types=(<span style="color: #f8fff9;">str</span>, <span style="color: #f8fff9;">bytes</span>)):
    <span style="color: #ff358b; font-weight: bold;">for</span> x <span style="color: #ff358b; font-weight: bold;">in</span> items:
        <span style="color: #ff358b; font-weight: bold;">if</span> <span style="color: #f8fff9;">isinstance</span>(x, Iterable) <span style="color: #ff358b; font-weight: bold;">and</span> <span style="color: #ff358b; font-weight: bold;">not</span> <span style="color: #f8fff9;">isinstance</span>(x, ignore_types):
            <span style="color: #ff358b; font-weight: bold;">yield</span> <span style="color: #ff358b; font-weight: bold;">from</span> flatten(x)
        <span style="color: #ff358b; font-weight: bold;">else</span>:
            <span style="color: #ff358b; font-weight: bold;">yield</span> x

<span style="color: #dddd66;">items</span> = [1, 2, [3, 4, [5, 6], 7], 8]

<span style="color: #465457;"># </span><span style="color: #465457;">Produces 1 2 3 4 5 6 7 8</span>
<span style="color: #ff358b; font-weight: bold;">for</span> x <span style="color: #ff358b; font-weight: bold;">in</span> flatten(items):
    <span style="color: #ff358b; font-weight: bold;">print</span>(x)

<span style="color: #dddd66;">items</span> = [<span style="color: #ffa042;">'Dave'</span>, <span style="color: #ffa042;">'Paula'</span>, [<span style="color: #ffa042;">'Thomas'</span>, <span style="color: #ffa042;">'Lewis'</span>]]
<span style="color: #ff358b; font-weight: bold;">for</span> x <span style="color: #ff358b; font-weight: bold;">in</span> flatten(items):
    <span style="color: #ff358b; font-weight: bold;">print</span>(x)

</pre>
</div>

<pre class="example">
1
2
3
4
5
6
7
8
Dave
Paula
Thomas
Lewis
</pre>
</div>
</div>
</div>


<div id="outline-container-org4a218de" class="outline-3">
<h3 id="org4a218de"><span class="section-number-3">3.2</span> 字典</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-org5b12f87" class="outline-4">
<h4 id="org5b12f87"><span class="section-number-4">3.2.1</span> 对字典作集合运算</h4>
<div class="outline-text-4" id="text-3-2-1">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #dddd66;">a</span> = {
   <span style="color: #ffa042;">'x'</span> : 1,
   <span style="color: #ffa042;">'y'</span> : 2,
   <span style="color: #ffa042;">'z'</span> : 3
}

<span style="color: #dddd66;">b</span> = {
   <span style="color: #ffa042;">'w'</span> : 10,
   <span style="color: #ffa042;">'x'</span> : 11,
   <span style="color: #ffa042;">'y'</span> : 2
}

<span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'Common keys:'</span>, a.keys() &amp; b.keys())
<span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'Keys in a not in b:'</span>, a.keys() - b.keys())
<span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'(key,value) pairs in common:'</span>, a.items() &amp; b.items())
</pre>
</div>

<pre class="example">
Common keys: {'y', 'x'}
Keys in a not in b: {'z'}
(key,value) pairs in common: {('y', 2)}

</pre>
</div>
</div>


<div id="outline-container-orgda8d31a" class="outline-4">
<h4 id="orgda8d31a"><span class="section-number-4">3.2.2</span> 组合多个字典当作一个字典使用</h4>
<div class="outline-text-4" id="text-3-2-2">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #dddd66;">a</span> = {<span style="color: #ffa042;">'x'</span>: 1, <span style="color: #ffa042;">'z'</span>: 3 }
<span style="color: #dddd66;">b</span> = {<span style="color: #ffa042;">'y'</span>: 2, <span style="color: #ffa042;">'z'</span>: 4 }

<span style="color: #465457;"># </span><span style="color: #465457;">(a) Simple example of combining</span>
<span style="color: #ff358b; font-weight: bold;">from</span> collections <span style="color: #ff358b; font-weight: bold;">import</span> ChainMap
<span style="color: #dddd66;">c</span> = ChainMap(a,b)

<span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">"c:"</span>, c)

<span style="color: #ff358b; font-weight: bold;">print</span>(c[<span style="color: #ffa042;">'x'</span>])      <span style="color: #465457;"># </span><span style="color: #465457;">Outputs 1  (from a)</span>
<span style="color: #ff358b; font-weight: bold;">print</span>(c[<span style="color: #ffa042;">'y'</span>])      <span style="color: #465457;"># </span><span style="color: #465457;">Outputs 2  (from b)</span>
<span style="color: #ff358b; font-weight: bold;">print</span>(c[<span style="color: #ffa042;">'z'</span>])      <span style="color: #465457;"># </span><span style="color: #465457;">Outputs 3  (from a)</span>

<span style="color: #465457;"># </span><span style="color: #465457;">Output some common values</span>
<span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'len(c):'</span>, <span style="color: #f8fff9;">len</span>(c))
<span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'c.keys():'</span>, <span style="color: #f8fff9;">list</span>(c.keys()))
<span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'c.values():'</span>, <span style="color: #f8fff9;">list</span>(c.values()))

<span style="color: #465457;"># </span><span style="color: #465457;">Modify some values</span>
<span style="color: #dddd66;">c</span>[<span style="color: #ffa042;">'z'</span>] = 10
<span style="color: #dddd66;">c</span>[<span style="color: #ffa042;">'w'</span>] = 40
<span style="color: #ff358b; font-weight: bold;">del</span> c[<span style="color: #ffa042;">'x'</span>]
<span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">"a:"</span>, a)
</pre>
</div>

<pre class="example">
c: ChainMap({'x': 1, 'z': 3}, {'y': 2, 'z': 4})
1
2
3
len(c): 3
c.keys(): ['z', 'y', 'x']
c.values(): [3, 2, 1]
a: {'z': 10, 'w': 40}

</pre>
</div>
</div>
