python3/cookbook.org
*** 字典栈

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  # Example of stacking mappings (like scopes)
  values = ChainMap()
  values['x'] = 1

  # Add a new mapping
  values = values.new_child()
  values['x'] = 2

  # Add a new mapping
  values = values.new_child()
  values['x'] = 3

  print(values)
  print(values['x'])

  # Discard last mapping
  values = values.parents
  print(values)
  print(values['x'])

  # Discard last mapping
  values = values.parents
  print(values)
  print(values['x'])
#+END_SRC

#+RESULTS:
: ChainMap({'x': 3}, {'x': 2}, {'x': 1})
: 3
: ChainMap({'x': 2}, {'x': 1})
: 2
: ChainMap({'x': 1})
: 1


** 队列

*** 优先队列

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  import heapq

  class PriorityQueue:
      def __init__(self):
          self._queue = []
          self._index = 0

      def push(self, item, priority):
          heapq.heappush(self._queue, (-priority, self._index, item))
          self._index += 1

      def pop(self):
          return heapq.heappop(self._queue)[-1]

  # Example use
  class Item:
      def __init__(self, name):
          self.name = name
      def __repr__(self):
          return 'Item({!r})'.format(self.name)

  q = PriorityQueue()
  q.push(Item('foo'), 1)
  q.push(Item('bar'), 5)
  q.push(Item('spam'), 4)
  q.push(Item('grok'), 1)

  print("Should be bar:", q.pop())
  print("Should be spam:", q.pop())
  print("Should be foo:", q.pop())
  print("Should be grok:", q.pop())
#+END_SRC

#+RESULTS:
: Should be bar: Item('bar')
: Should be spam: Item('spam')
: Should be foo: Item('foo')
: Should be grok: Item('grok')




* IO

** 文件

*** 将文件描述符包装成文件对象

#+BEGIN_SRC ipython
  from socket import socket, AF_INET, SOCK_STREAM

  def echo_client(client_sock, addr):
      print("Got connection from", addr)

      # Make text-mode file wrappers for socket reading/writing
      client_in = open(client_sock.fileno(), 'rt', encoding='latin-1', closefd=False)
      client_out = open(client_sock.fileno(), 'wt', encoding='latin-1', closefd=False)

      # Echo lines back to the client using file I/O
      for line in client_in:
          client_out.write(line)
          client_out.flush()
      client_sock.close()

  def echo_server(address):
      sock = socket(AF_INET, SOCK_STREAM)
      sock.bind(address)
      sock.listen(1)
      while True:
          client, addr = sock.accept()
          echo_client(client, addr)

  print('Echo serving running on localhost:25000')
  echo_server(('', 25000))
#+END_SRC

*** 改变已打开文件的编码方式

#+BEGIN_SRC ipython
  # Example of adding a text encoding to existing file-like object

  import urllib.request
  import io

  u = urllib.request.urlopen('http://www.python.org')
  f = io.TextIOWrapper(u, encoding='utf-8')
  text = f.read()

  print(text)
#+END_SRC


** 内存 IO

*** 内存字符串

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  from io import StringIO
  f = StringIO()
  f.write('hello')
  f.write(' ')
  f.write('world!')
  print(f.getvalue())
#+END_SRC

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  f = StringIO('Hello!\nHi!\nGoodbye!')
  while True:
      s = f.readline()
      if s == '':  # eof
          break
      print(s, end='')
#+END_SRC


*** 内存比特流

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  from io import BytesIO
  f = BytesIO()
  f.write('中文'.encode('utf-8'))
  print(f.getvalue())
#+END_SRC

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  f = BytesIO(b'\xe4\xb8\xad\xe6\x96\x87')
  r = f.read().decode('utf-8')
  print(r)
#+END_SRC



