python3/cookbook.html


<div id="outline-container-org9e8ea17" class="outline-4">
<h4 id="org9e8ea17"><span class="section-number-4">3.2.3</span> 字典栈</h4>
<div class="outline-text-4" id="text-3-2-3">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #465457;"># </span><span style="color: #465457;">Example of stacking mappings (like scopes)</span>
<span style="color: #dddd66;">values</span> = ChainMap()
<span style="color: #dddd66;">values</span>[<span style="color: #ffa042;">'x'</span>] = 1

<span style="color: #465457;"># </span><span style="color: #465457;">Add a new mapping</span>
<span style="color: #dddd66;">values</span> = values.new_child()
<span style="color: #dddd66;">values</span>[<span style="color: #ffa042;">'x'</span>] = 2

<span style="color: #465457;"># </span><span style="color: #465457;">Add a new mapping</span>
<span style="color: #dddd66;">values</span> = values.new_child()
<span style="color: #dddd66;">values</span>[<span style="color: #ffa042;">'x'</span>] = 3

<span style="color: #ff358b; font-weight: bold;">print</span>(values)
<span style="color: #ff358b; font-weight: bold;">print</span>(values[<span style="color: #ffa042;">'x'</span>])

<span style="color: #465457;"># </span><span style="color: #465457;">Discard last mapping</span>
<span style="color: #dddd66;">values</span> = values.parents
<span style="color: #ff358b; font-weight: bold;">print</span>(values)
<span style="color: #ff358b; font-weight: bold;">print</span>(values[<span style="color: #ffa042;">'x'</span>])

<span style="color: #465457;"># </span><span style="color: #465457;">Discard last mapping</span>
<span style="color: #dddd66;">values</span> = values.parents
<span style="color: #ff358b; font-weight: bold;">print</span>(values)
<span style="color: #ff358b; font-weight: bold;">print</span>(values[<span style="color: #ffa042;">'x'</span>])
</pre>
</div>

<pre class="example">
ChainMap({'x': 3}, {'x': 2}, {'x': 1})
3
ChainMap({'x': 2}, {'x': 1})
2
ChainMap({'x': 1})
1

</pre>
</div>
</div>
</div>


<div id="outline-container-org809b10f" class="outline-3">
<h3 id="org809b10f"><span class="section-number-3">3.3</span> 队列</h3>
<div class="outline-text-3" id="text-3-3">
</div>
<div id="outline-container-org009d4f8" class="outline-4">
<h4 id="org009d4f8"><span class="section-number-4">3.3.1</span> 优先队列</h4>
<div class="outline-text-4" id="text-3-3-1">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #ff358b; font-weight: bold;">import</span> heapq

<span style="color: #ff358b; font-weight: bold;">class</span> <span style="color: #01b0f0; font-weight: bold;">PriorityQueue</span>:
    <span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">__init__</span>(<span style="color: #ff358b; font-weight: bold;">self</span>):
        <span style="color: #ff358b; font-weight: bold;">self</span>._queue = []
        <span style="color: #ff358b; font-weight: bold;">self</span>._index = 0

    <span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">push</span>(<span style="color: #ff358b; font-weight: bold;">self</span>, item, priority):
        heapq.heappush(<span style="color: #ff358b; font-weight: bold;">self</span>._queue, (-priority, <span style="color: #ff358b; font-weight: bold;">self</span>._index, item))
        <span style="color: #ff358b; font-weight: bold;">self</span>._index += 1

    <span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">pop</span>(<span style="color: #ff358b; font-weight: bold;">self</span>):
        <span style="color: #ff358b; font-weight: bold;">return</span> heapq.heappop(<span style="color: #ff358b; font-weight: bold;">self</span>._queue)[-1]

<span style="color: #465457;"># </span><span style="color: #465457;">Example use</span>
<span style="color: #ff358b; font-weight: bold;">class</span> <span style="color: #01b0f0; font-weight: bold;">Item</span>:
    <span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">__init__</span>(<span style="color: #ff358b; font-weight: bold;">self</span>, name):
        <span style="color: #ff358b; font-weight: bold;">self</span>.name = name
    <span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">__repr__</span>(<span style="color: #ff358b; font-weight: bold;">self</span>):
        <span style="color: #ff358b; font-weight: bold;">return</span> <span style="color: #ffa042;">'Item({!r})'</span>.<span style="color: #f8fff9;">format</span>(<span style="color: #ff358b; font-weight: bold;">self</span>.name)

<span style="color: #dddd66;">q</span> = PriorityQueue()
q.push(Item(<span style="color: #ffa042;">'foo'</span>), 1)
q.push(Item(<span style="color: #ffa042;">'bar'</span>), 5)
q.push(Item(<span style="color: #ffa042;">'spam'</span>), 4)
q.push(Item(<span style="color: #ffa042;">'grok'</span>), 1)

<span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">"Should be bar:"</span>, q.pop())
<span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">"Should be spam:"</span>, q.pop())
<span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">"Should be foo:"</span>, q.pop())
<span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">"Should be grok:"</span>, q.pop())
</pre>
</div>

<pre class="example">
Should be bar: Item('bar')
Should be spam: Item('spam')
Should be foo: Item('foo')
Should be grok: Item('grok')

</pre>
</div>
</div>
</div>
</div>




<div id="outline-container-org7cf8b6c" class="outline-2">
<h2 id="org7cf8b6c"><span class="section-number-2">4</span> IO</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org02f86c0" class="outline-3">
<h3 id="org02f86c0"><span class="section-number-3">4.1</span> 文件</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-org39b5fa3" class="outline-4">
<h4 id="org39b5fa3"><span class="section-number-4">4.1.1</span> 将文件描述符包装成文件对象</h4>
<div class="outline-text-4" id="text-4-1-1">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #ff358b; font-weight: bold;">from</span> socket <span style="color: #ff358b; font-weight: bold;">import</span> socket, AF_INET, SOCK_STREAM

<span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">echo_client</span>(client_sock, addr):
    <span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">"Got connection from"</span>, addr)

    <span style="color: #465457;"># </span><span style="color: #465457;">Make text-mode file wrappers for socket reading/writing</span>
    <span style="color: #dddd66;">client_in</span> = <span style="color: #f8fff9;">open</span>(client_sock.fileno(), <span style="color: #ffa042;">'rt'</span>, encoding=<span style="color: #ffa042;">'latin-1'</span>, closefd=<span style="color: #b994ff;">False</span>)
    <span style="color: #dddd66;">client_out</span> = <span style="color: #f8fff9;">open</span>(client_sock.fileno(), <span style="color: #ffa042;">'wt'</span>, encoding=<span style="color: #ffa042;">'latin-1'</span>, closefd=<span style="color: #b994ff;">False</span>)

    <span style="color: #465457;"># </span><span style="color: #465457;">Echo lines back to the client using file I/O</span>
    <span style="color: #ff358b; font-weight: bold;">for</span> line <span style="color: #ff358b; font-weight: bold;">in</span> client_in:
        client_out.write(line)
        client_out.flush()
    client_sock.close()

<span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">echo_server</span>(address):
    <span style="color: #dddd66;">sock</span> = socket(AF_INET, SOCK_STREAM)
    sock.bind(address)
    sock.listen(1)
    <span style="color: #ff358b; font-weight: bold;">while</span> <span style="color: #b994ff;">True</span>:
        <span style="color: #dddd66;">client</span>, <span style="color: #dddd66;">addr</span> = sock.accept()
        echo_client(client, addr)

<span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'Echo serving running on localhost:25000'</span>)
echo_server((<span style="color: #ffa042;">''</span>, 25000))
</pre>
</div>
</div>
</div>

<div id="outline-container-orga098a6d" class="outline-4">
<h4 id="orga098a6d"><span class="section-number-4">4.1.2</span> 改变已打开文件的编码方式</h4>
<div class="outline-text-4" id="text-4-1-2">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #465457;"># </span><span style="color: #465457;">Example of adding a text encoding to existing file-like object</span>

<span style="color: #ff358b; font-weight: bold;">import</span> urllib.request
<span style="color: #ff358b; font-weight: bold;">import</span> io

<span style="color: #dddd66;">u</span> = urllib.request.urlopen(<span style="color: #ffa042;">'http://www.python.org'</span>)
<span style="color: #dddd66;">f</span> = io.TextIOWrapper(u, encoding=<span style="color: #ffa042;">'utf-8'</span>)
<span style="color: #dddd66;">text</span> = f.read()

<span style="color: #ff358b; font-weight: bold;">print</span>(text)
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org87d8b82" class="outline-3">
<h3 id="org87d8b82"><span class="section-number-3">4.2</span> 内存 IO</h3>
<div class="outline-text-3" id="text-4-2">
</div>
<div id="outline-container-org3473dc3" class="outline-4">
<h4 id="org3473dc3"><span class="section-number-4">4.2.1</span> 内存字符串</h4>
<div class="outline-text-4" id="text-4-2-1">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #ff358b; font-weight: bold;">from</span> io <span style="color: #ff358b; font-weight: bold;">import</span> StringIO
<span style="color: #dddd66;">f</span> = StringIO()
f.write(<span style="color: #ffa042;">'hello'</span>)
f.write(<span style="color: #ffa042;">' '</span>)
f.write(<span style="color: #ffa042;">'world!'</span>)
<span style="color: #ff358b; font-weight: bold;">print</span>(f.getvalue())
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #dddd66;">f</span> = StringIO(<span style="color: #ffa042;">'Hello!\nHi!\nGoodbye!'</span>)
<span style="color: #ff358b; font-weight: bold;">while</span> <span style="color: #b994ff;">True</span>:
    <span style="color: #dddd66;">s</span> = f.readline()
    <span style="color: #ff358b; font-weight: bold;">if</span> s == <span style="color: #ffa042;">''</span>:  <span style="color: #465457;"># </span><span style="color: #465457;">eof</span>
        <span style="color: #ff358b; font-weight: bold;">break</span>
    <span style="color: #ff358b; font-weight: bold;">print</span>(s, end=<span style="color: #ffa042;">''</span>)
</pre>
</div>
</div>
</div>


<div id="outline-container-orgc138684" class="outline-4">
<h4 id="orgc138684"><span class="section-number-4">4.2.2</span> 内存比特流</h4>
<div class="outline-text-4" id="text-4-2-2">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #ff358b; font-weight: bold;">from</span> io <span style="color: #ff358b; font-weight: bold;">import</span> BytesIO
<span style="color: #dddd66;">f</span> = BytesIO()
f.write(<span style="color: #ffa042;">'&#20013;&#25991;'</span>.encode(<span style="color: #ffa042;">'utf-8'</span>))
<span style="color: #ff358b; font-weight: bold;">print</span>(f.getvalue())
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #dddd66;">f</span> = BytesIO(b<span style="color: #ffa042;">'\xe4\xb8\xad\xe6\x96\x87'</span>)
<span style="color: #dddd66;">r</span> = f.read().decode(<span style="color: #ffa042;">'utf-8'</span>)
<span style="color: #ff358b; font-weight: bold;">print</span>(r)
</pre>
</div>
</div>
</div>
</div>
