python3/cookbook.org
** 读写 JSON

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  # Some advanced JSON examples involving ordered dicts and classes
  import json

  # Some JSON encoded text
  s = '{"name": "ACME", "shares": 50, "price": 490.1}'

  # (a) Turning JSON into an OrderedDict

  from collections import OrderedDict
  data = json.loads(s, object_pairs_hook=OrderedDict)
  print(data)

  # (b) Using JSON to populate an instance

  class JSONObject:
      def __init__(self, d):
          self.__dict__ = d

  data = json.loads(s, object_hook=JSONObject)
  print(data.name)
  print(data.shares)
  print(data.price)

  # (c) Encoding instances

  class Point:
      def __init__(self, x, y):
          self.x = x
          self.y = y

  def serialize_instance(obj):
      d = { '__classname__' : type(obj).__name__ }
      d.update(vars(obj))
      return d

  p = Point(3,4)
  s = json.dumps(p, default=serialize_instance)
  print(s)

  # (d) Decoding instances
  classes = {
      'Point' : Point
  }

  def unserialize_object(d):
      clsname = d.pop('__classname__', None)
      if clsname:
          cls = classes[clsname]
          obj = cls.__new__(cls)
          for key, value in d.items():
              setattr(obj, key, value)
          return obj
      else:
          return d

  a = json.loads(s, object_hook=unserialize_object)
  print(a)
  print(a.x)
  print(a.y)
#+END_SRC

#+RESULTS:
: OrderedDict([('name', 'ACME'), ('shares', 50), ('price', 490.1)])
: ACME
: 50
: 490.1
: {"__classname__": "Point", "x": 3, "y": 4}
: <__main__.Point object at 0x1086228d0>
: 3
: 4


* 模块

** 猴子补丁

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  import importlib
  import sys
  from collections import defaultdict

  _post_import_hooks = defaultdict(list)

  class PostImportFinder:
      def __init__(self):
          self._skip = set()

      def find_module(self, fullname, path=None):
          if fullname in self._skip:
              return None
          self._skip.add(fullname)
          return PostImportLoader(self)

  class PostImportLoader:
      def __init__(self, finder):
          self._finder = finder

      def load_module(self, fullname):
          importlib.import_module(fullname)
          module = sys.modules[fullname]
          for func in _post_import_hooks[fullname]:
              func(module)
          self._finder._skip.remove(fullname)
          return module

  def when_imported(fullname):
      def decorate(func):
          if fullname in sys.modules:
              func(sys.modules[fullname])
          else:
              _post_import_hooks[fullname].append(func)
          return func
      return decorate

  sys.meta_path.insert(0, PostImportFinder())
#+END_SRC

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  @when_imported('threading')
  def warn_threads(mod):
      print('Threads? Are you crazy?')

  import threading
#+END_SRC


** 将模块拆分出多个文件

模块 mymodule 目录结构：

#+BEGIN_EXAMPLE
  mymodule
  ├── __init__.py
  ├── a.py
  └── b.py
#+END_EXAMPLE

=__init__.py= 文件内容:

#+BEGIN_EXAMPLE
  from .a import A
  from .b import B
#+END_EXAMPLE

=a.py= 文件内容：

#+BEGIN_EXAMPLE
  class A:
      def spam(self):
          print('A.spam')
#+END_EXAMPLE

=b.py= 文件内容：

#+BEGIN_EXAMPLE
  from .a import A

  class B(A):
      def bar(self):
          print('B.bar')
#+END_EXAMPLE

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  import mymodule
  a = mymodule.A()
  a.spam()

  b = mymodule.B()
  b.bar()
#+END_SRC


* 数字，日期，时间

** time 模块

time 模块始终返回 UTC 时间。

*** 获取 Unix Timestamp

即从 Epoch (1970年1月1日00:00:00 UTC) 开始所经过的秒数。

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  import time
  print(time.time())
#+END_SRC

