python3/cookbook.html



<div id="outline-container-org602171e" class="outline-3">
<h3 id="org602171e"><span class="section-number-3">4.3</span> 读写 JSON</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #465457;"># </span><span style="color: #465457;">Some advanced JSON examples involving ordered dicts and classes</span>
<span style="color: #ff358b; font-weight: bold;">import</span> json

<span style="color: #465457;"># </span><span style="color: #465457;">Some JSON encoded text</span>
<span style="color: #dddd66;">s</span> = <span style="color: #ffa042;">'{"name": "ACME", "shares": 50, "price": 490.1}'</span>

<span style="color: #465457;"># </span><span style="color: #465457;">(a) Turning JSON into an OrderedDict</span>

<span style="color: #ff358b; font-weight: bold;">from</span> collections <span style="color: #ff358b; font-weight: bold;">import</span> OrderedDict
<span style="color: #dddd66;">data</span> = json.loads(s, object_pairs_hook=OrderedDict)
<span style="color: #ff358b; font-weight: bold;">print</span>(data)

<span style="color: #465457;"># </span><span style="color: #465457;">(b) Using JSON to populate an instance</span>

<span style="color: #ff358b; font-weight: bold;">class</span> <span style="color: #01b0f0; font-weight: bold;">JSONObject</span>:
    <span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">__init__</span>(<span style="color: #ff358b; font-weight: bold;">self</span>, d):
        <span style="color: #ff358b; font-weight: bold;">self</span>.__dict__ = d

<span style="color: #dddd66;">data</span> = json.loads(s, object_hook=JSONObject)
<span style="color: #ff358b; font-weight: bold;">print</span>(data.name)
<span style="color: #ff358b; font-weight: bold;">print</span>(data.shares)
<span style="color: #ff358b; font-weight: bold;">print</span>(data.price)

<span style="color: #465457;"># </span><span style="color: #465457;">(c) Encoding instances</span>

<span style="color: #ff358b; font-weight: bold;">class</span> <span style="color: #01b0f0; font-weight: bold;">Point</span>:
    <span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">__init__</span>(<span style="color: #ff358b; font-weight: bold;">self</span>, x, y):
        <span style="color: #ff358b; font-weight: bold;">self</span>.x = x
        <span style="color: #ff358b; font-weight: bold;">self</span>.y = y

<span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">serialize_instance</span>(obj):
    <span style="color: #dddd66;">d</span> = { <span style="color: #ffa042;">'__classname__'</span> : <span style="color: #f8fff9;">type</span>(obj).<span style="color: #f8fff9;">__name__</span> }
    d.update(<span style="color: #f8fff9;">vars</span>(obj))
    <span style="color: #ff358b; font-weight: bold;">return</span> d

<span style="color: #dddd66;">p</span> = Point(3,4)
<span style="color: #dddd66;">s</span> = json.dumps(p, default=serialize_instance)
<span style="color: #ff358b; font-weight: bold;">print</span>(s)

<span style="color: #465457;"># </span><span style="color: #465457;">(d) Decoding instances</span>
<span style="color: #dddd66;">classes</span> = {
    <span style="color: #ffa042;">'Point'</span> : Point
}

<span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">unserialize_object</span>(d):
    <span style="color: #dddd66;">clsname</span> = d.pop(<span style="color: #ffa042;">'__classname__'</span>, <span style="color: #b994ff;">None</span>)
    <span style="color: #ff358b; font-weight: bold;">if</span> clsname:
        <span style="color: #dddd66;">cls</span> = classes[clsname]
        <span style="color: #dddd66;">obj</span> = cls.__new__(cls)
        <span style="color: #ff358b; font-weight: bold;">for</span> key, value <span style="color: #ff358b; font-weight: bold;">in</span> d.items():
            <span style="color: #f8fff9;">setattr</span>(obj, key, value)
        <span style="color: #ff358b; font-weight: bold;">return</span> obj
    <span style="color: #ff358b; font-weight: bold;">else</span>:
        <span style="color: #ff358b; font-weight: bold;">return</span> d

<span style="color: #dddd66;">a</span> = json.loads(s, object_hook=unserialize_object)
<span style="color: #ff358b; font-weight: bold;">print</span>(a)
<span style="color: #ff358b; font-weight: bold;">print</span>(a.x)
<span style="color: #ff358b; font-weight: bold;">print</span>(a.y)
</pre>
</div>

<pre class="example">
OrderedDict([('name', 'ACME'), ('shares', 50), ('price', 490.1)])
ACME
50
490.1
{"__classname__": "Point", "x": 3, "y": 4}
&lt;__main__.Point object at 0x1086228d0&gt;
3
4

</pre>
</div>
</div>
</div>


<div id="outline-container-org45510ee" class="outline-2">
<h2 id="org45510ee"><span class="section-number-2">5</span> 模块</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgb2b88b7" class="outline-3">
<h3 id="orgb2b88b7"><span class="section-number-3">5.1</span> 猴子补丁</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #ff358b; font-weight: bold;">import</span> importlib
<span style="color: #ff358b; font-weight: bold;">import</span> sys
<span style="color: #ff358b; font-weight: bold;">from</span> collections <span style="color: #ff358b; font-weight: bold;">import</span> defaultdict

<span style="color: #dddd66;">_post_import_hooks</span> = defaultdict(<span style="color: #f8fff9;">list</span>)

<span style="color: #ff358b; font-weight: bold;">class</span> <span style="color: #01b0f0; font-weight: bold;">PostImportFinder</span>:
    <span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">__init__</span>(<span style="color: #ff358b; font-weight: bold;">self</span>):
        <span style="color: #ff358b; font-weight: bold;">self</span>._skip = <span style="color: #f8fff9;">set</span>()

    <span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">find_module</span>(<span style="color: #ff358b; font-weight: bold;">self</span>, fullname, path=<span style="color: #b994ff;">None</span>):
        <span style="color: #ff358b; font-weight: bold;">if</span> fullname <span style="color: #ff358b; font-weight: bold;">in</span> <span style="color: #ff358b; font-weight: bold;">self</span>._skip:
            <span style="color: #ff358b; font-weight: bold;">return</span> <span style="color: #b994ff;">None</span>
        <span style="color: #ff358b; font-weight: bold;">self</span>._skip.add(fullname)
        <span style="color: #ff358b; font-weight: bold;">return</span> PostImportLoader(<span style="color: #ff358b; font-weight: bold;">self</span>)

<span style="color: #ff358b; font-weight: bold;">class</span> <span style="color: #01b0f0; font-weight: bold;">PostImportLoader</span>:
    <span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">__init__</span>(<span style="color: #ff358b; font-weight: bold;">self</span>, finder):
        <span style="color: #ff358b; font-weight: bold;">self</span>._finder = finder

    <span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">load_module</span>(<span style="color: #ff358b; font-weight: bold;">self</span>, fullname):
        importlib.import_module(fullname)
        <span style="color: #dddd66;">module</span> = sys.modules[fullname]
        <span style="color: #ff358b; font-weight: bold;">for</span> func <span style="color: #ff358b; font-weight: bold;">in</span> _post_import_hooks[fullname]:
            func(module)
        <span style="color: #ff358b; font-weight: bold;">self</span>._finder._skip.remove(fullname)
        <span style="color: #ff358b; font-weight: bold;">return</span> module

<span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">when_imported</span>(fullname):
    <span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">decorate</span>(func):
        <span style="color: #ff358b; font-weight: bold;">if</span> fullname <span style="color: #ff358b; font-weight: bold;">in</span> sys.modules:
            func(sys.modules[fullname])
        <span style="color: #ff358b; font-weight: bold;">else</span>:
            _post_import_hooks[fullname].append(func)
        <span style="color: #ff358b; font-weight: bold;">return</span> func
    <span style="color: #ff358b; font-weight: bold;">return</span> decorate

sys.meta_path.insert(0, PostImportFinder())
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #01b0f0; font-weight: bold;">@when_imported</span>(<span style="color: #ffa042;">'threading'</span>)
<span style="color: #ff358b; font-weight: bold;">def</span> <span style="color: #f8fff9;">warn_threads</span>(mod):
    <span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'Threads? Are you crazy?'</span>)

<span style="color: #ff358b; font-weight: bold;">import</span> threading
</pre>
</div>
</div>
</div>


<div id="outline-container-org3526916" class="outline-3">
<h3 id="org3526916"><span class="section-number-3">5.2</span> 将模块拆分出多个文件</h3>
<div class="outline-text-3" id="text-5-2">
<p>
模块 mymodule 目录结构：
</p>

<pre class="example">
mymodule
├── __init__.py
├── a.py
└── b.py
</pre>

<p>
<code>__init__.py</code> 文件内容:
</p>

<pre class="example">
from .a import A
from .b import B
</pre>

<p>
<code>a.py</code> 文件内容：
</p>

<pre class="example">
class A:
    def spam(self):
        print('A.spam')
</pre>

<p>
<code>b.py</code> 文件内容：
</p>

<pre class="example">
from .a import A

class B(A):
    def bar(self):
        print('B.bar')
</pre>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #ff358b; font-weight: bold;">import</span> mymodule
<span style="color: #dddd66;">a</span> = mymodule.A()
a.spam()

<span style="color: #dddd66;">b</span> = mymodule.B()
b.bar()
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgec0490b" class="outline-2">
<h2 id="orgec0490b"><span class="section-number-2">6</span> 数字，日期，时间</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orga6aa54e" class="outline-3">
<h3 id="orga6aa54e"><span class="section-number-3">6.1</span> time 模块</h3>
<div class="outline-text-3" id="text-6-1">
<p>
time 模块始终返回 UTC 时间。
</p>
</div>

<div id="outline-container-org70ae658" class="outline-4">
<h4 id="org70ae658"><span class="section-number-4">6.1.1</span> 获取 Unix Timestamp</h4>
<div class="outline-text-4" id="text-6-1-1">
<p>
即从 Epoch (1970年1月1日00:00:00 UTC) 开始所经过的秒数。
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #ff358b; font-weight: bold;">import</span> time
<span style="color: #ff358b; font-weight: bold;">print</span>(time.time())
</pre>
</div>
</div>
</div>
