python3/cookbook.org
*** 获取具体时间值

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  current_time = time.time()
  current_struct_time = time.gmtime(current_time)
  print(current_struct_time)
#+END_SRC

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  current_year = current_struct_time.tm_year
  current_mon  = current_struct_time.tm_mon
  current_mday = current_struct_time.tm_mday
  current_hour = current_struct_time.tm_hour
  current_min  = current_struct_time.tm_min
  r = (current_year, current_mon, current_mday, current_hour, current_min)
  print(r)
#+END_SRC

** datetime 模块

datetime 模块简化了日期操作，如增加天数，设置时区等。

*** 创建时间

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  import datetime
  d = datetime.datetime(year=2017, month=12, day=31, hour=12, minute=59, second=59)
  r = (d.year, d.month, d.day, d.hour, d.minute, d.second, d.microsecond)
  print(r)
#+END_SRC


*** 获取 UTC 时间

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  print(datetime.datetime.utcnow())
#+END_SRC


*** 获取当前时区时间

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  print(datetime.datetime.now())
#+END_SRC

*** 日期运算

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  today = datetime.datetime.now()
  diff = datetime.timedelta(weeks=3, days=2)
  future = today + diff
  past = today - diff
  print((future, past))
#+END_SRC


*** 日期转字符串

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  r = '{:%Y-%m-%d %H:%M}'.format(datetime.datetime(2001, 2, 3, 4, 5))
  print(r)
#+END_SRC


*** 字符串转日期

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  r = datetime.datetime.strptime("Mar 03, 2010", "%b %d, %Y")
  print(r)
#+END_SRC

** 月份缩写

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  from calendar import month_abbr
  print(list(month_abbr))
#+END_SRC


** 数字精度格式化

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  print('{:06.2f}'.format(3.141592653589793))
  print('{:04d}'.format(42))
  print('{:+d}'.format(42))
  print('{: d}'.format(42))
  print('{: d}'.format(-42))
  print('{:=5d}'.format((- 23)))
  print('{:=+5d}'.format((23)))

#+END_SRC


* 字符串与文本

** 格式化

*** 填充与对齐

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  print('{:>10}'.format('test'))
  print('{:10}'.format('test'))
  print('{:^10}'.format('test'))
  print('{:_<10}'.format('test'))
#+END_SRC


*** 字符串截断

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  print('{:.5}'.format('xylophone'))
  print('{:10.5}'.format('xylophone'))
#+END_SRC


*** 占位符

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  data = {'first': 'Hodor', 'last': 'Hodor!'}
  print('{first} {last}'.format(**data))

  print('{first} {last}'.format(first='Hodor', last='Hodor!'))
#+END_SRC

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  person = {'first': 'Jean-Luc', 'last': 'Picard'}
  data = [4, 8, 15, 16, 23, 42]
  class Plant(object):
      category = 'tree'
      kinds = [{'name': 'oak'}, {'name': 'maple'}]

  print('{p[first]} {p[last]}'.format(p=person))
  print('{d[4]} {d[5]}'.format(d=data))
  print('{p.category}: {p.kinds[0][name]}'.format(p=Plant()))
#+END_SRC



