python3/cookbook.html

<div id="outline-container-orgaba317d" class="outline-4">
<h4 id="orgaba317d"><span class="section-number-4">6.1.2</span> 获取具体时间值</h4>
<div class="outline-text-4" id="text-6-1-2">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #dddd66;">current_time</span> = time.time()
<span style="color: #dddd66;">current_struct_time</span> = time.gmtime(current_time)
<span style="color: #ff358b; font-weight: bold;">print</span>(current_struct_time)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #dddd66;">current_year</span> = current_struct_time.tm_year
<span style="color: #dddd66;">current_mon</span>  = current_struct_time.tm_mon
<span style="color: #dddd66;">current_mday</span> = current_struct_time.tm_mday
<span style="color: #dddd66;">current_hour</span> = current_struct_time.tm_hour
<span style="color: #dddd66;">current_min</span>  = current_struct_time.tm_min
<span style="color: #dddd66;">r</span> = (current_year, current_mon, current_mday, current_hour, current_min)
<span style="color: #ff358b; font-weight: bold;">print</span>(r)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org64a2472" class="outline-3">
<h3 id="org64a2472"><span class="section-number-3">6.2</span> datetime 模块</h3>
<div class="outline-text-3" id="text-6-2">
<p>
datetime 模块简化了日期操作，如增加天数，设置时区等。
</p>
</div>

<div id="outline-container-orgff1c716" class="outline-4">
<h4 id="orgff1c716"><span class="section-number-4">6.2.1</span> 创建时间</h4>
<div class="outline-text-4" id="text-6-2-1">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #ff358b; font-weight: bold;">import</span> datetime
<span style="color: #dddd66;">d</span> = datetime.datetime(year=2017, month=12, day=31, hour=12, minute=59, second=59)
<span style="color: #dddd66;">r</span> = (d.year, d.month, d.day, d.hour, d.minute, d.second, d.microsecond)
<span style="color: #ff358b; font-weight: bold;">print</span>(r)
</pre>
</div>
</div>
</div>


<div id="outline-container-org93ede71" class="outline-4">
<h4 id="org93ede71"><span class="section-number-4">6.2.2</span> 获取 UTC 时间</h4>
<div class="outline-text-4" id="text-6-2-2">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #ff358b; font-weight: bold;">print</span>(datetime.datetime.utcnow())
</pre>
</div>
</div>
</div>


<div id="outline-container-org3a96270" class="outline-4">
<h4 id="org3a96270"><span class="section-number-4">6.2.3</span> 获取当前时区时间</h4>
<div class="outline-text-4" id="text-6-2-3">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #ff358b; font-weight: bold;">print</span>(datetime.datetime.now())
</pre>
</div>
</div>
</div>

<div id="outline-container-org73db004" class="outline-4">
<h4 id="org73db004"><span class="section-number-4">6.2.4</span> 日期运算</h4>
<div class="outline-text-4" id="text-6-2-4">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #dddd66;">today</span> = datetime.datetime.now()
<span style="color: #dddd66;">diff</span> = datetime.timedelta(weeks=3, days=2)
<span style="color: #dddd66;">future</span> = today + diff
<span style="color: #dddd66;">past</span> = today - diff
<span style="color: #ff358b; font-weight: bold;">print</span>((future, past))
</pre>
</div>
</div>
</div>


<div id="outline-container-org8d839c3" class="outline-4">
<h4 id="org8d839c3"><span class="section-number-4">6.2.5</span> 日期转字符串</h4>
<div class="outline-text-4" id="text-6-2-5">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #dddd66;">r</span> = <span style="color: #ffa042;">'{:%Y-%m-%d %H:%M}'</span>.<span style="color: #f8fff9;">format</span>(datetime.datetime(2001, 2, 3, 4, 5))
<span style="color: #ff358b; font-weight: bold;">print</span>(r)
</pre>
</div>
</div>
</div>


<div id="outline-container-orgeb80278" class="outline-4">
<h4 id="orgeb80278"><span class="section-number-4">6.2.6</span> 字符串转日期</h4>
<div class="outline-text-4" id="text-6-2-6">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #dddd66;">r</span> = datetime.datetime.strptime(<span style="color: #ffa042;">"Mar 03, 2010"</span>, <span style="color: #ffa042;">"%b %d, %Y"</span>)
<span style="color: #ff358b; font-weight: bold;">print</span>(r)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8e63728" class="outline-3">
<h3 id="org8e63728"><span class="section-number-3">6.3</span> 月份缩写</h3>
<div class="outline-text-3" id="text-6-3">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #ff358b; font-weight: bold;">from</span> calendar <span style="color: #ff358b; font-weight: bold;">import</span> month_abbr
<span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #f8fff9;">list</span>(month_abbr))
</pre>
</div>
</div>
</div>


<div id="outline-container-org22640c6" class="outline-3">
<h3 id="org22640c6"><span class="section-number-3">6.4</span> 数字精度格式化</h3>
<div class="outline-text-3" id="text-6-4">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'{:06.2f}'</span>.<span style="color: #f8fff9;">format</span>(3.141592653589793))
<span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'{:04d}'</span>.<span style="color: #f8fff9;">format</span>(42))
<span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'{:+d}'</span>.<span style="color: #f8fff9;">format</span>(42))
<span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'{: d}'</span>.<span style="color: #f8fff9;">format</span>(42))
<span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'{: d}'</span>.<span style="color: #f8fff9;">format</span>(-42))
<span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'{:=5d}'</span>.<span style="color: #f8fff9;">format</span>((- 23)))
<span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'{:=+5d}'</span>.<span style="color: #f8fff9;">format</span>((23)))

</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org1de1780" class="outline-2">
<h2 id="org1de1780"><span class="section-number-2">7</span> 字符串与文本</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org4e2a36b" class="outline-3">
<h3 id="org4e2a36b"><span class="section-number-3">7.1</span> 格式化</h3>
<div class="outline-text-3" id="text-7-1">
</div>
<div id="outline-container-orgeb87feb" class="outline-4">
<h4 id="orgeb87feb"><span class="section-number-4">7.1.1</span> 填充与对齐</h4>
<div class="outline-text-4" id="text-7-1-1">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'{:&gt;10}'</span>.<span style="color: #f8fff9;">format</span>(<span style="color: #ffa042;">'test'</span>))
<span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'{:10}'</span>.<span style="color: #f8fff9;">format</span>(<span style="color: #ffa042;">'test'</span>))
<span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'{:^10}'</span>.<span style="color: #f8fff9;">format</span>(<span style="color: #ffa042;">'test'</span>))
<span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'{:_&lt;10}'</span>.<span style="color: #f8fff9;">format</span>(<span style="color: #ffa042;">'test'</span>))
</pre>
</div>
</div>
</div>


<div id="outline-container-orgd8a1681" class="outline-4">
<h4 id="orgd8a1681"><span class="section-number-4">7.1.2</span> 字符串截断</h4>
<div class="outline-text-4" id="text-7-1-2">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'{:.5}'</span>.<span style="color: #f8fff9;">format</span>(<span style="color: #ffa042;">'xylophone'</span>))
<span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'{:10.5}'</span>.<span style="color: #f8fff9;">format</span>(<span style="color: #ffa042;">'xylophone'</span>))
</pre>
</div>
</div>
</div>


<div id="outline-container-org778ad33" class="outline-4">
<h4 id="org778ad33"><span class="section-number-4">7.1.3</span> 占位符</h4>
<div class="outline-text-4" id="text-7-1-3">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #dddd66;">data</span> = {<span style="color: #ffa042;">'first'</span>: <span style="color: #ffa042;">'Hodor'</span>, <span style="color: #ffa042;">'last'</span>: <span style="color: #ffa042;">'Hodor!'</span>}
<span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'{first} {last}'</span>.<span style="color: #f8fff9;">format</span>(**data))

<span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'{first} {last}'</span>.<span style="color: #f8fff9;">format</span>(first=<span style="color: #ffa042;">'Hodor'</span>, last=<span style="color: #ffa042;">'Hodor!'</span>))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #dddd66;">person</span> = {<span style="color: #ffa042;">'first'</span>: <span style="color: #ffa042;">'Jean-Luc'</span>, <span style="color: #ffa042;">'last'</span>: <span style="color: #ffa042;">'Picard'</span>}
<span style="color: #dddd66;">data</span> = [4, 8, 15, 16, 23, 42]
<span style="color: #ff358b; font-weight: bold;">class</span> <span style="color: #01b0f0; font-weight: bold;">Plant</span>(<span style="color: #f8fff9;">object</span>):
    <span style="color: #dddd66;">category</span> = <span style="color: #ffa042;">'tree'</span>
    <span style="color: #dddd66;">kinds</span> = [{<span style="color: #ffa042;">'name'</span>: <span style="color: #ffa042;">'oak'</span>}, {<span style="color: #ffa042;">'name'</span>: <span style="color: #ffa042;">'maple'</span>}]

<span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'{p[first]} {p[last]}'</span>.<span style="color: #f8fff9;">format</span>(p=person))
<span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'{d[4]} {d[5]}'</span>.<span style="color: #f8fff9;">format</span>(d=data))
<span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'{p.category}: {p.kinds[0][name]}'</span>.<span style="color: #f8fff9;">format</span>(p=Plant()))
</pre>
</div>
</div>
</div>
