python3/cookbook.org
*** 排版

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  import textwrap

  s = "Look into my eyes, look into my eyes, the eyes, the eyes, \
  the eyes, not around the eyes, don't look around the eyes, \
  look into my eyes, you're under."

  print(textwrap.fill(s, 70))
  print()

  print(textwrap.fill(s, 40))
  print()

  print(textwrap.fill(s, 40, initial_indent='    '))
  print()

  print(textwrap.fill(s, 40, subsequent_indent='    '))
  print()
#+END_SRC

** 字符串匹配

*** 使用 shell 风格的通配符匹配字符串

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  from fnmatch import fnmatchcase as match

  addresses = [
      '5412 N CLARK ST',
      '1060 W ADDISON ST',
      '1039 W GRANVILLE AVE',
      '2122 N CLARK ST',
      '4802 N BROADWAY',
  ]

  a = [addr for addr in addresses if match(addr, '* ST')]
  print(a)

  b = [addr for addr in addresses if match(addr, '54[0-9][0-9] *CLARK*')]
  print(b)
#+END_SRC


*** 贪婪和非贪婪匹配

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  import re

  # Sample text
  text = 'Computer says "no." Phone says "yes."'

  # (a) Regex that finds quoted strings - longest match
  str_pat = re.compile(r'\"(.*)\"')
  print(str_pat.findall(text))

  # (b) Regex that finds quoted strings - shortest match
  str_pat = re.compile(r'\"(.*?)\"')
  print(str_pat.findall(text))
#+END_SRC


** 密码输入

#+BEGIN_SRC ipython
  import getpass

  user = getpass.getuser()
  passwd = getpass.getpass()

  print('User:', user)
  print('Passwd:', passwd)
#+END_SRC


* 参考资料