python3/cookbook.html



<div id="outline-container-orgeb49139" class="outline-4">
<h4 id="orgeb49139"><span class="section-number-4">7.1.4</span> 排版</h4>
<div class="outline-text-4" id="text-7-1-4">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #ff358b; font-weight: bold;">import</span> textwrap

<span style="color: #dddd66;">s</span> = <span style="color: #ffa042;">"Look into my eyes, look into my eyes, the eyes, the eyes, \</span>
<span style="color: #ffa042;">the eyes, not around the eyes, don't look around the eyes, \</span>
<span style="color: #ffa042;">look into my eyes, you're under."</span>

<span style="color: #ff358b; font-weight: bold;">print</span>(textwrap.fill(s, 70))
<span style="color: #ff358b; font-weight: bold;">print</span>()

<span style="color: #ff358b; font-weight: bold;">print</span>(textwrap.fill(s, 40))
<span style="color: #ff358b; font-weight: bold;">print</span>()

<span style="color: #ff358b; font-weight: bold;">print</span>(textwrap.fill(s, 40, initial_indent=<span style="color: #ffa042;">'    '</span>))
<span style="color: #ff358b; font-weight: bold;">print</span>()

<span style="color: #ff358b; font-weight: bold;">print</span>(textwrap.fill(s, 40, subsequent_indent=<span style="color: #ffa042;">'    '</span>))
<span style="color: #ff358b; font-weight: bold;">print</span>()
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2861a98" class="outline-3">
<h3 id="org2861a98"><span class="section-number-3">7.2</span> 字符串匹配</h3>
<div class="outline-text-3" id="text-7-2">
</div>
<div id="outline-container-org3080b82" class="outline-4">
<h4 id="org3080b82"><span class="section-number-4">7.2.1</span> 使用 shell 风格的通配符匹配字符串</h4>
<div class="outline-text-4" id="text-7-2-1">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #ff358b; font-weight: bold;">from</span> fnmatch <span style="color: #ff358b; font-weight: bold;">import</span> fnmatchcase <span style="color: #ff358b; font-weight: bold;">as</span> match

<span style="color: #dddd66;">addresses</span> = [
    <span style="color: #ffa042;">'5412 N CLARK ST'</span>,
    <span style="color: #ffa042;">'1060 W ADDISON ST'</span>,
    <span style="color: #ffa042;">'1039 W GRANVILLE AVE'</span>,
    <span style="color: #ffa042;">'2122 N CLARK ST'</span>,
    <span style="color: #ffa042;">'4802 N BROADWAY'</span>,
]

<span style="color: #dddd66;">a</span> = [addr <span style="color: #ff358b; font-weight: bold;">for</span> addr <span style="color: #ff358b; font-weight: bold;">in</span> addresses <span style="color: #ff358b; font-weight: bold;">if</span> match(addr, <span style="color: #ffa042;">'* ST'</span>)]
<span style="color: #ff358b; font-weight: bold;">print</span>(a)

<span style="color: #dddd66;">b</span> = [addr <span style="color: #ff358b; font-weight: bold;">for</span> addr <span style="color: #ff358b; font-weight: bold;">in</span> addresses <span style="color: #ff358b; font-weight: bold;">if</span> match(addr, <span style="color: #ffa042;">'54[0-9][0-9] *CLARK*'</span>)]
<span style="color: #ff358b; font-weight: bold;">print</span>(b)
</pre>
</div>
</div>
</div>


<div id="outline-container-org6724b0d" class="outline-4">
<h4 id="org6724b0d"><span class="section-number-4">7.2.2</span> 贪婪和非贪婪匹配</h4>
<div class="outline-text-4" id="text-7-2-2">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #ff358b; font-weight: bold;">import</span> re

<span style="color: #465457;"># </span><span style="color: #465457;">Sample text</span>
<span style="color: #dddd66;">text</span> = <span style="color: #ffa042;">'Computer says "no." Phone says "yes."'</span>

<span style="color: #465457;"># </span><span style="color: #465457;">(a) Regex that finds quoted strings - longest match</span>
<span style="color: #dddd66;">str_pat</span> = re.<span style="color: #f8fff9;">compile</span>(r<span style="color: #ffa042;">'\"(.*)\"'</span>)
<span style="color: #ff358b; font-weight: bold;">print</span>(str_pat.findall(text))

<span style="color: #465457;"># </span><span style="color: #465457;">(b) Regex that finds quoted strings - shortest match</span>
<span style="color: #dddd66;">str_pat</span> = re.<span style="color: #f8fff9;">compile</span>(r<span style="color: #ffa042;">'\"(.*?)\"'</span>)
<span style="color: #ff358b; font-weight: bold;">print</span>(str_pat.findall(text))
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org8becbcb" class="outline-3">
<h3 id="org8becbcb"><span class="section-number-3">7.3</span> 密码输入</h3>
<div class="outline-text-3" id="text-7-3">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #ff358b; font-weight: bold;">import</span> getpass

<span style="color: #dddd66;">user</span> = getpass.getuser()
<span style="color: #dddd66;">passwd</span> = getpass.getpass()

<span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'User:'</span>, user)
<span style="color: #ff358b; font-weight: bold;">print</span>(<span style="color: #ffa042;">'Passwd:'</span>, passwd)
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgd5d3c81" class="outline-2">
<h2 id="orgd5d3c81"><span class="section-number-2">8</span> 参考资料</h2>
</div>
</div>
</body>
</html>